Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
#include <Arduino.h>
#include <stdio.h>
#include <stdint.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stdlib.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/queue.h>
// #include <pwm_audio.h>
#include "pwm_audio.h"
#include <math.h>
#include <esp_log.h>
#include "ssd1306.h"
#include "vol_table.h"
#include <string.h>
#include "esp32-hal-cpu.h"
#include <Adafruit_ST7735.h>

#include "esp_spiffs.h"
#include <dirent.h>
#include "listfile.h"
#include "NULL_MOD.h"
#include "driver/i2s.h"
#include "driver/gpio.h"
#include "driver/temp_sensor.h"

#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "write_wav.h"
#include "esp_dsp.h"
#include "ESPRotary.h"
#include "audioTypedef.h"
#include <Adafruit_MPR121.h>
#include "abcd.h"
#include "3x5font.h"
#include "esp32/clk.h"
#include "bfs_snake.h"

#define MOUNT_POINT "/sdcard"

#define TFT_DC 3
#define TFT_CS 10
#define TFT_RST 8
uint8_t tracker_data_header[1084];
uint8_t **tracker_data_pattern = NULL;
int8_t *tracker_data_sample[33];
uint8_t *tracker_data_total;
// uint8_t *tracker_data;

void read_pattern_table(uint8_t head_data[1084]);
void read_samp_info(uint8_t head_data[1084]);
inline void read_part_data(uint8_t** tracker_data, uint8_t pattern_index, uint8_t row_index, uint8_t channel_index, uint16_t part_data[4]);
inline void refsPopUp();

bool PopUpExist;
// void comp_wave_ofst();
#define CHL_NUM 4
#define TRACKER_ROW 64
uint8_t NUM_PATTERNS;
#define BUFFER_PATTERNS 2
#define NUM_ROWS 64
#define NUM_CHANNELS 4
#define PATTERN_SIZE (NUM_ROWS * NUM_CHANNELS * 4)
#define BUFF_SIZE 1024

bool recMod = false;
FILE *export_wav_file;
size_t export_wav_written = 0;
void *export_wav_buffer;
uint8_t inputOct = 2;
bool editMod = false;
uint16_t limitStats;
bool fromOtherPage = false;

Adafruit_ST7735 tft = Adafruit_ST7735(TFT_CS, TFT_DC, TFT_RST);
Adafruit_MPR121 touchPad = Adafruit_MPR121();
ESPRotary rotary;
bool RtyL = false;
bool RtyR = false;
bool RtyB = false;

#define RTY_VOL 1
#define RTY_MIX 2
#define RTY_CPU 3

uint8_t RTY_MOD = RTY_VOL;

static uint8_t pat_max = 0;

typedef enum {
    KEY_IDLE,
    KEY_ATTACK,
    KEY_RELEASE
} key_status_t;

typedef struct {
    uint8_t num;
    key_status_t status;
} key_event_t;

QueueHandle_t xTouchPadQueue;
QueueHandle_t xOptionKeyQueue;

#define readOptionKeyEvent xQueueReceive(xOptionKeyQueue, &optionKeyEvent, 0)
#define readTouchPadKeyEvent xQueueReceive(xTouchPadQueue, &touchPadEvent, 0)
#define KEY_UP 1
#define KEY_DOWN 2
#define KEY_L 3
#define KEY_R 4
#define KEY_OK 5
#define KEY_SPACE 6
#define KEY_A 7
#define KEY_B 8
#define KEY_C 9
#define LCD_BK 9
class aFrameBuffer : public Adafruit_GFX {
  public:
    uint16_t lcd_buffer[40960];
    aFrameBuffer(int16_t w, int16_t h): Adafruit_GFX(w, h) {
        printf("DISPLAY READLY!\n");
    }
    IRAM_ATTR void drawPixel(int16_t x, int16_t y, uint16_t color)
    {
        if (x > 159)
            return;
        if (x < 0)
            return;
        if (y > 127)
            return;
        if (y < 0)
            return;
        lcd_buffer[x + y * _width] = color;
    }

    void display() {if (PopUpExist) refsPopUp();tft.drawRGBBitmap(0, 0, lcd_buffer, 160, 128);}
};

aFrameBuffer frame(160, 128);

#define SMP_RATE 48000
#define SMP_BIT 8
float *buffer_ch[NUM_CHANNELS];
void* buffer;
float time_step = 1.0 / SMP_RATE;
int8_t vol[CHL_NUM] = {0, 0, 0, 0};

size_t wrin;
uint8_t stp;
static bool display_stat = true;

uint8_t part_table[128];
int8_t part_point = 0;
int8_t row_point = 0;
char song_name[20];

bool dispRedy = false;
bool dispReadConfigStatus = false;
bool dispSdcardError = false;
bool dispReadingFile = false;
bool dispReadingFileError = false;
bool dispShowEfct = false;
bool playStat = false;
uint32_t wave_MAX_L = 0;
uint32_t wave_MAX_R = 0;
uint32_t wave_MAX_L_OUT = 0;
uint32_t wave_MAX_R_OUT = 0;
bool MAX_COMP_FINISH = false;

#define CONFIG_FILE_PATH "/spiffs/esp32tracker.config"

typedef struct {
    bool enbLine;
    bool enbCos;
    bool enbCubic;
    bool enbFltr[4];
    bool enbDelay[4];
    float cutOffFreq[4];
} Config_t;

Config_t config;

bool readConfig(Config_t *config) {
    FILE *file = fopen(CONFIG_FILE_PATH, "rb");
    if (file == NULL) {
        printf("Failed to open config file for reading\n");
        return false;
    }

    size_t readSize = fread(config, sizeof(Config_t), 1, file);
    fclose(file);

    if (readSize != 1) {
        printf("Failed to read config file\n");
        return false;
    }

    printf("Config file read successfully\n");
    return true;
}

bool writeConfig(const Config_t *config) {
    FILE *file = fopen(CONFIG_FILE_PATH, "wb");
    if (file == NULL) {
        printf("Failed to open config file for writing\n");
        return false;
    }

    size_t writeSize = fwrite(config, sizeof(Config_t), 1, file);
    fclose(file);

    if (writeSize != 1) {
        printf("Failed to write config file\n");
        return false;
    }

    printf("Config file written successfully\n");
    return true;
}

void copyFile(const char *sourceFile, const char *destFile) {
    FILE *source, *dest;
    char buffer[1024];
    size_t bytesRead;

    source = fopen(sourceFile, "rb");
    if (source == NULL) {
        perror("Failed to open source file");
        exit(EXIT_FAILURE);
    }

    dest = fopen(destFile, "wb");
    if (dest == NULL) {
        fclose(source);
        perror("Failed to open destination file");
        exit(EXIT_FAILURE);
    }

    while ((bytesRead = fread(buffer, 1, sizeof(buffer), source)) > 0) {
        fwrite(buffer, 1, bytesRead, dest);
    }

    fclose(source);
    fclose(dest);

    printf("File copied successfully from %s to %s\n", sourceFile, destFile);
}

const float patch_table[16] = {3546836.0f, 3572537.835745873f, 3598425.9175884672f, 3624501.595143772f, 3650766.227807657f, 3677221.184826728f, 3703867.8453697185f, 3730707.5985993897f,
                         3347767.391694687f, 3372026.6942439806f, 3396461.7896998064f, 3421073.9519300302f, 3445864.464033491f, 3470834.61840689f, 3495985.7168121682f, 3521319.0704443706f};

#define hexToDecimalTens(num) (((num) >> 4) & 0x0F)
#define hexToDecimalOnes(num) ((num) & 0x0F)
#define hexToRow(num) (hexToDecimalTens(num) * 10 + hexToDecimalOnes(num))
#define freq_up(base_freq, n) ((base_freq) * powf(2.0f, ((n) / 12.0f)))

#define drawMidRect(w, h, color) \
    frame.drawRect(80 - ((w) >> 1), 64 - ((h) >> 1), (80 + ((w) >> 1)) - (80 - ((w) >> 1)), (64 + ((h) >> 1)) - (64 - ((h) >> 1)), (color))

