Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
#define drawMidRectOfst(w, h, color, ofstX, ofstY) \
    frame.drawRect(80 - ((w) >> 1) + (ofstX), 64 - ((h) >> 1) + (ofstY), \
                   (w), (h), (color))

#define fillMidRect(w, h, color) \
    frame.fillRect(80 - ((w) >> 1), 64 - ((h) >> 1), (80 + ((w) >> 1)) - (80 - ((w) >> 1)), (64 + ((h) >> 1)) - (64 - ((h) >> 1)), (color))

#define fillMidRectOfst(w, h, color, ofstX, ofstY) \
    frame.fillRect(80 - ((w) >> 1) + (ofstX), 64 - ((h) >> 1) + (ofstY), \
                   (w), (h), (color))

#define setMidCusr(w, h, ofst) \
    frame.setCursor(80 - ((w) >> 1) + (ofst), 64 - ((h) >> 1) + (ofst))

#define setMidCusrOfst(w, h, ofstX, ofstY) \
    frame.setCursor(80 - ((w) >> 1) + (ofstX), 64 - ((h) >> 1) + (ofstY))

inline int clamp(int value, int min, int max) {
    if (value < min)
        return min;
    else if (value > max)
        return max;
    else
        return value;
}

float fast_exp(float x) {
    union {
        float f;
        uint32_t i;
    } u;
    u.i = (uint32_t)(12102203 * x + 1064866805);
    return u.f;
}

class Animation {
public:
    float startX, startY;
    float endX, endY;
    int16_t currentX, currentY;
    uint16_t step;
    uint16_t maxSteps;

    void initAnimation(float x1, float y1, float x2, float y2, uint16_t maxStep) {
        startX = x1;
        startY = y1;
        endX = x2;
        endY = y2;
        currentX = startX;
        currentY = startY;
        step = 0;
        maxSteps = maxStep;
    }

    inline int16_t getAnimationX() {
        return currentX;
    }

    inline int16_t getAnimationY() {
        return currentY;
    }

    void nextAnimation(float k) {
        if (step < maxSteps) {
            float t = (float)step / (float)maxSteps;
            float scale = 1.0f - fast_exp(-k * t);  // 使用指数衰减函数
            
            currentX = roundf(startX * (1 - scale) + endX * scale);
            currentY = roundf(startY * (1 - scale) + endY * scale);

            step++;
        }
    }
};

void backlightCtrl(void *arg) {
    printf("BACKLIGHT START\n");
    // analogWriteFrequency(22050);
    for (uint16_t i = 0; i < 256; i++) {
        analogWrite(LCD_BK, i);
        vTaskDelay(2);
        // printf("BK %d\n", i);
    }
    printf("BACKLIGHT END\n");
    vTaskDelete(NULL);
}
/*
void backlightCtrlFast(void *arg) {
    printf("BACKLIGHT FAST START\n");
    // analogWriteFrequency(22050);
    for (uint16_t i = 0; i < 256; i++) {
        analogWrite(LCD_BK, i);
        vTaskDelay(1);
        // printf("BK %d\n", i);
    }
    printf("BACKLIGHT FAST END\n");
    vTaskDelete(NULL);
}
*/

int find_max(int size) {
    if (size <= 0) {
        return -1;
    }
    int max = part_table[0];
    for (int i = 1; i < size; i++) {
        if (part_table[i] > max) {
            max = part_table[i];
        }
    }
    return max;
}

typedef struct {
    char name[22];
    uint16_t len;
    uint8_t finetune;
    uint8_t vol;
    uint16_t loopStart;
    uint16_t loopLen;
} samp_info_t;

samp_info_t samp_info[33];
uint32_t wav_ofst[34];

bool mute[4] = {false, false, false, false};

#define DELAY_BUFFER_SIZE 4096

float delayBuffer[6][4096];
int delayWriteIndex[6] = {0, 0, 0, 0, 0, 0};

void initDelayBuffer() {
    for (int i = 0; i < DELAY_BUFFER_SIZE; ++i) {
        delayBuffer[0][i] = 0.0f;
        delayBuffer[1][i] = 0.0f;
        delayBuffer[2][i] = 0.0f;
        delayBuffer[3][i] = 0.0f;
        delayBuffer[4][i] = 0.0f;
        delayBuffer[5][i] = 0.0f;
    }
}

float audioDelay(float inputSample, int delayLength, float decayRate, float dryMix, float wetMix, uint8_t chl) {
    if (delayLength >= DELAY_BUFFER_SIZE) {
        delayLength = DELAY_BUFFER_SIZE - 1;
    }

    int readIndex = delayWriteIndex[chl] - delayLength;
    if (readIndex < 0) {
        readIndex += DELAY_BUFFER_SIZE;
    }

    float outputSample = delayBuffer[chl][readIndex];
    delayBuffer[chl][delayWriteIndex[chl]] = inputSample + decayRate * outputSample;
    delayWriteIndex[chl] = (delayWriteIndex[chl] + 1) & (DELAY_BUFFER_SIZE - 1);
    return dryMix * inputSample + wetMix * outputSample;
}

// 适用于每次输入单个样本点的一阶低通滤波器
static float lastOutputs[NUM_CHANNELS] = {0};

float lowPassFilterSingleSample(float sample, int chl, float cutoffFreqIn, uint16_t sampleRate) {
    if (chl < 0 || chl >= NUM_CHANNELS) {
        printf("Channel index out of range.\n");
        return sample;
    }
    if ((uint16_t)cutoffFreqIn == sampleRate || cutoffFreqIn <= 0) return sample;
    float alpha = cutoffFreqIn / (cutoffFreqIn + sampleRate);
    return lastOutputs[chl] = alpha * sample + (1 - alpha) * lastOutputs[chl];
}

int8_t read_tracker_file(const char* path) {
    uint8_t *tracker_header_back = (uint8_t*)malloc(1084);
    printf("NOW READ FILE %s\n", path);
    FILE *file = fopen(path, "rb");

    if (!file) {
        printf("Failed to open file %s\n", path);
        return -1;
    }
    memcpy(tracker_header_back, tracker_data_header, 1084);
    size_t readRelly = fread(tracker_data_header, 1, 1084, file);
    printf("READ HEADER FINISH\n");
    if (readRelly < 1084) {
        printf("READ %s ERROR! FILE TOO SMALL! FILE SIZE IS %zu\n", path, readRelly);
        fclose(file);
        memcpy(tracker_data_header, tracker_header_back, 1084);
        free(tracker_header_back);
        return -1;
    }

    if ((tracker_data_header[1080] != 0x4D) ||
        (tracker_data_header[1081] != 0x2E) ||
        (tracker_data_header[1082] != 0x4B) ||
        (tracker_data_header[1083] != 0x2E)) {
        printf("READ %s ERROR! NOT A M.K. MOD FILE! HEAD=%c%c%c%c\n", path, 
            tracker_data_header[1080], tracker_data_header[1081], 
            tracker_data_header[1082], tracker_data_header[1083]);
        fclose(file);
        memcpy(tracker_data_header, tracker_header_back, 1084);
        free(tracker_header_back);
        return -1;
    }

    free(tracker_header_back);

    // Free previously allocated memory for patterns
    for (uint8_t i = 0; i < pat_max; i++) {
        if (tracker_data_pattern && tracker_data_pattern[i]) {
            printf("FREE PAT #%d ADRS %p\n", i, tracker_data_pattern[i]);
            free(tracker_data_pattern[i]);
            tracker_data_pattern[i] = NULL;
        }
    }

    if (tracker_data_pattern) {
        printf("PAT ADRS %p\n", tracker_data_pattern);
        free(tracker_data_pattern);
        tracker_data_pattern = NULL;
    }

    // Free previously allocated memory for samples
    for (uint8_t i = 0; i < 33; i++) {
        if (tracker_data_sample[i]) {
            printf("FREE SMP #%d ADRS %p\n", i, tracker_data_sample[i]);
            free(tracker_data_sample[i]);
            tracker_data_sample[i] = NULL;
        }
    }

    read_pattern_table(tracker_data_header);
    read_samp_info(tracker_data_header);
    pat_max = find_max(NUM_PATTERNS) + 1;
    tracker_data_pattern = (uint8_t**)malloc(pat_max * sizeof(uint8_t*));
    if (!tracker_data_pattern) {
        printf("UNKNOWN MALLOC FAIL...\n");
        fclose(file);
        return -2;
    }

    printf("HEAD NOW FILE POS %ld\n", ftell(file));
    for (uint8_t i = 0; i < pat_max; i++) {
        tracker_data_pattern[i] = (uint8_t*)malloc(1024);
        if (!tracker_data_pattern[i]) {
            printf("READ PATTERN MALLOC FAIL! EXITING...\n");
            for (uint8_t j = 0; j < i; j++) {
                free(tracker_data_pattern[j]);
            }
            free(tracker_data_pattern);
            fclose(file);
            return -2;
        }
        fread(tracker_data_pattern[i], 1, 1024, file);
    }

    printf("PAT NOW FILE POS %ld\n", ftell(file));
    for (uint8_t i = 1; i < 33; i++) {
        if (samp_info[i].len) {
            tracker_data_sample[i] = (int8_t*)malloc(samp_info[i].len << 1);
            if (!tracker_data_sample[i]) {
                printf("READ SAMPLE MALLOC FAIL! EXITING...\n");
                for (uint8_t j = 0; j < pat_max; j++) {
                    free(tracker_data_pattern[j]);
                }
                free(tracker_data_pattern);
                for (uint8_t j = 0; j <= i; j++) {
                    free(tracker_data_sample[j + 1]);
                }
                fclose(file);
                return -2;
            }
            fread(tracker_data_sample[i], 2, samp_info[i].len, file);
            printf("READ SMP #%d SIZE: %d STATUS %p\n", i + 1, samp_info[i].len<<1, tracker_data_sample[i]);
        }
    }

    printf("FINISH NOW FILE POS %ld\n", ftell(file));
    printf("READ %s FINISH!\n", path);
    fclose(file);
    return 0;
}

bool new_tracker_file() {

    for (uint8_t i = 0; i < pat_max; i++) {
        if (tracker_data_pattern && tracker_data_pattern[i]) {
            printf("FREE PAT #%d ADRS %p\n", i, tracker_data_pattern[i]);
            free(tracker_data_pattern[i]);
            tracker_data_pattern[i] = NULL;
        }
    }
    if (tracker_data_pattern) {
        printf("PAT ADRS %p\n", tracker_data_pattern);
        free(tracker_data_pattern);
        tracker_data_pattern = NULL;
    }

    // Free previously allocated memory for samples
    for (uint8_t i = 0; i < 33; i++) {
        if (tracker_data_sample[i]) {
            printf("FREE SMP #%d ADRS %p\n", i, tracker_data_sample[i]);
            free(tracker_data_sample[i]);
            tracker_data_sample[i] = NULL;
        }
    }

    if (tracker_data_header == NULL) {
        printf("CREATE NEW FILE ON MEM FAILED!\n");
        return 1;
    }
    for (uint16_t p = 0; p < 1084; p++) {
        tracker_data_header[p] = tracker_null[p];
    }
    read_pattern_table(tracker_data_header);
    read_samp_info(tracker_data_header);
    pat_max = find_max(NUM_PATTERNS)+1;
    tracker_data_pattern = (uint8_t**)malloc(pat_max*sizeof(uint8_t*));
    for (uint8_t i = 0; i < pat_max; i++) {
        tracker_data_pattern[i] = (uint8_t*)malloc(1024);
        if (tracker_data_pattern[i] == NULL) {printf("READ PATTERN MALLOC FAIL! EXITNG...\n"); exit(-1);}
        for (uint16_t j = 0; j < 1024; j++) {
            tracker_data_pattern[i][j] = 0;
        }
    }
    for (uint8_t i = 0; i < 32; i++) {
        //if (wave_info[i][0]) fread(tracker_data_sample[i], 1, wave_info[i+1][0], file);
    }
    printf("CREATE NEW FILE ON MEM FINISH!\n");
    return 0;
}

void comp(void *arg);
void load(void *arg);
// **************************INIT*END****************************

int16_t period[4] = {0, 0, 0, 0};
float frq[4] = {0, 0, 0, 0};
float data_index[CHL_NUM] = {0, 0, 0, 0};
bool view_mode = false;
uint8_t smp_num[CHL_NUM] = {0, 0, 0, 0};
float global_vol = 1.0f;

int16_t temp;

bool master_delay = false;
bool master_limit = true;
float stroMix = 0.45f;

// Limit
typedef struct {
    int16_t threshold;
    int16_t soft_knee;
} Limiter;

bool snake_mod = false;

void initLimiter(Limiter *limiter, int16_t threshold, float soft_knee) {
    limiter->threshold = threshold;
    limiter->soft_knee = soft_knee;
}

static inline int16_t audioLimit(Limiter *limiter, int16_t inputSample, uint16_t *limitOutComp) {
    int16_t absInputSample = inputSample > 0 ? inputSample : -inputSample;

