Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
    if (absInputSample > limiter->threshold) {
        *limitOutComp = absInputSample - limiter->threshold;
        float normalizedExcess = (float)(absInputSample - limiter->threshold) / limiter->soft_knee;
        float compressedExcess = tanhf(normalizedExcess) * limiter->soft_knee;
        int16_t compressedSample = limiter->threshold + (int16_t)compressedExcess;
        return inputSample > 0 ? compressedSample : -compressedSample;
    } else {
        *limitOutComp = 0;
        return inputSample;
    }
}

typedef struct
{ 
    size_t write_size;
    void *write_src;
    bool status;
} i2s_write_config_t;

i2s_write_config_t i2s_write_config;
TaskHandle_t I2S_WRITE_H;

void i2s_write_task(void *arg) { for (;;) {
    if (i2s_write_config.write_src != NULL) 
        i2s_write(I2S_NUM_0, i2s_write_config.write_src, i2s_write_config.write_size, &wrin, portMAX_DELAY);
    i2s_write_config.status = false;
    vTaskSuspend(NULL);
}}

Limiter limiter;

int8_t audio_master_write(void *src, uint8_t numChl, size_t size, size_t len) {
    audio16BitStro *buffer16BitStro = (audio16BitStro*)src;
    for (uint16_t i = 0; i < len; i++) {
        if (size == 4) {
            buffer16BitStro[i].dataL *= global_vol;
            buffer16BitStro[i].dataR *= global_vol;
        } else {
            return -1;
        }
        if (master_limit) {
            buffer16BitStro[i].dataL = audioLimit(&limiter, buffer16BitStro[i].dataL, &limitStats);
            buffer16BitStro[i].dataR = audioLimit(&limiter, buffer16BitStro[i].dataR, &limitStats);
        }
        if (master_delay) {
            buffer16BitStro[i].dataL = audioDelay(buffer16BitStro[i].dataL, 4096, 0.4f, 0.8f, 0.2f, 4);
            buffer16BitStro[i].dataR = audioDelay(buffer16BitStro[i].dataR, 4096, 0.4f, 0.8f, 0.2f, 5);
        }
        int16_t inputL = buffer16BitStro[i].dataL;
        int16_t inputR = buffer16BitStro[i].dataR;
        buffer16BitStro[i].dataL = (int16_t)((1.0f - stroMix) * inputL + stroMix * inputR);
        buffer16BitStro[i].dataR = (int16_t)((1.0f - stroMix) * inputR + stroMix * inputL);
        wave_MAX_L += abs(buffer16BitStro[i].dataL);
        wave_MAX_R += abs(buffer16BitStro[i].dataR);
    }
    wave_MAX_L_OUT = wave_MAX_L / 2560;
    wave_MAX_L = 0;
    wave_MAX_R_OUT = wave_MAX_R / 2560;
    wave_MAX_R = 0;
    MAX_COMP_FINISH = true;
    i2s_write_config.write_src = buffer16BitStro;
    i2s_write_config.write_size = len*size;
    i2s_write_config.status = true;
    if (recMod) wav_audio_write(i2s_write_config.write_src, i2s_write_config.write_size, &wrin, export_wav_file);
    else {
        vTaskResume(I2S_WRITE_H);
        while (i2s_write_config.status) {vTaskDelay(1);}
    }
    // printf("L=%5d R=%5d\n", wave_MAX_L_OUT, wave_MAX_R_OUT);
    return 0;
}

// OSC START -----------------------------------------------------
void display(void *arg) {
    Snake snake;
    Point food, direction = {1, 0};
    char ten[24];
    char one[24];
    uint16_t viewTmp[4];
    SSD1306_t dev;
    char efct[17];
    uint8_t showTmpEFX1[4];
    uint8_t showTmpEFX2_1[4];
    uint8_t showTmpEFX2_2[4];
    i2c_master_init(&dev, 1, 2, -1);
    ssd1306_init(&dev, 128, 64);
    ssd1306_clear_screen(&dev, false);
    ssd1306_contrast(&dev, 0xff);
    ssd1306_display_text(&dev, 0, "Welcome to", 11, false);
    ssd1306_display_text(&dev, 1, "ESP32Tracker", 13, false);
    ssd1306_display_text(&dev, 2, "BOOTING....", 12, false);
    vTaskDelay(32);
    for (;;) {
        vTaskDelay(32);
        if (dispRedy) break;
    }
    ssd1306_display_text(&dev, 3, "READ CONFIG....", 16, false);
    for (;;) {
        vTaskDelay(32);
        if (dispSdcardError) ssd1306_display_text(&dev, 4, "SDCARD ERROR!!!", 16, false);
        if (dispReadConfigStatus) break;
    }
    vTaskDelay(32);
    for (;;) {
        uint8_t x;
        uint8_t volTemp;
        uint8_t addr[4];
        if (view_mode) {
            if (MAX_COMP_FINISH) {
                MAX_COMP_FINISH = false;
                sprintf(ten, limitStats ? "LIMIT: %5dOVER" : "LIMIT: NO ACTIVE", limitStats);
                ssd1306_clear_buffer(&dev);
                ssd1306_display_text(&dev, 0, "VIEW MODE", 10, false);
                ssd1306_display_text(&dev, 1, ten, 16, false);
                for (uint8_t i = 0; i < 16; i++) {
                    _ssd1306_line(&dev, 0, i+20, wave_MAX_L_OUT>>8, i+20, false);
                }
                for (uint8_t i = 0; i < 16; i++) {
                    _ssd1306_line(&dev, 0, i+38, wave_MAX_R_OUT>>8, i+38, false);
                }
                ssd1306_show_buffer(&dev);
            } else {
                vTaskDelay(1);
            }
        } else if (dispReadingFile) {
            ssd1306_clear_buffer(&dev);
            for (uint8_t i = 0; i < 7; i++) {
                ssd1306_display_text(&dev, i, "               ", 16, false);
            }
            ssd1306_display_text(&dev, 7, dispReadingFileError ? "READ FILE ERROR" : "READING FILE...", 16, false);
            vTaskDelay(128);
        } else {
            if (snake_mod) {
                srand(234*buffer16BitStro[1].dataL+buffer16BitStro[2].dataR*buffer16BitStro[3].dataL+buffer16BitStro[6].dataR+buffer16BitStro[2].dataL+buffer16BitStro[9].dataR*1234);
                init_snake(&snake);
                init_food(&food, &snake);
                for (;;) {
                    if (!astar(&snake, food, &direction)) {
                        Point next_position = {snake.body[0].x + direction.x, snake.body[0].y + direction.y};
                        if (!is_valid(next_position, &snake)) {
                            game_over(&dev);
                            snake_mod = false;
                            break;
                        }
                    }
                    move_snake(&snake, direction);

                    if (snake.body[0].x == food.x && snake.body[0].y == food.y) {
                        grow_snake(&snake);
                        init_food(&food, &snake);
                    }

