Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
                    draw_game(&snake, food, &dev);
                    vTaskDelay(1);
                }
                free(snake.body);
            } else {
                for (uint8_t contr = 0; contr < 4; contr++) {
                    ssd1306_clear_buffer(&dev);

                    switch (RTY_MOD)
                    {
                    case RTY_VOL:
                        sprintf(ten, " VOL: %d    ", (int8_t)(global_vol*100));
                        break;
                    
                    case RTY_MIX:
                        sprintf(ten, " MIX: %d    ", (int8_t)(stroMix*100));
                        break;

                    case RTY_CPU:
                        sprintf(ten, " %2d %2d>%2d %d  ", row_point, part_point, part_table[part_point], limitStats ? limitStats : (uint8_t)(stroMix*100));
                        break;
                    }

                    addr[0] = (uint8_t)(data_index[0] * (16.0f / samp_info[smp_num[0]].len)) & 31;
                    addr[1] = (uint8_t)(data_index[1] * (16.0f / samp_info[smp_num[1]].len)) & 31;
                    addr[2] = (uint8_t)(data_index[2] * (16.0f / samp_info[smp_num[2]].len)) & 31;
                    addr[3] = (uint8_t)(data_index[3] * (16.0f / samp_info[smp_num[3]].len)) & 31;
                    // printf("%d %d %d %d\n", addr[0], addr[1], addr[2], addr[3]);
                    ssd1306_display_text(&dev, 0, "CH1 CH2 CH3 CH4", 16, false);
                    if (dispShowEfct) {
                        if (tracker_data_pattern != NULL && tracker_data_pattern[part_table[part_point]] != NULL) {
                            for (uint8_t i = 0; i < NUM_CHANNELS; i++) {
                                read_part_data(tracker_data_pattern, part_table[part_point], row_point, i, viewTmp);
                                showTmpEFX1[i] = viewTmp[2];
                                showTmpEFX2_1[i] = hexToDecimalTens(viewTmp[3]);
                                showTmpEFX2_2[i] = hexToDecimalOnes(viewTmp[3]);
                            }
                        } else {
                            for (uint8_t i = 0; i < NUM_CHANNELS; i++) {
                            showTmpEFX1[i] = 0;
                            showTmpEFX2_1[i] = 0;
                            showTmpEFX2_2[i] = 0;
                            }
                        }
                        sprintf(efct, " %X%X%X %X%X%X %X%X%X %X%X%X",   showTmpEFX1[0], showTmpEFX2_1[0], showTmpEFX2_2[0],
                                                                        showTmpEFX1[1], showTmpEFX2_1[1], showTmpEFX2_2[1],
                                                                        showTmpEFX1[2], showTmpEFX2_1[2], showTmpEFX2_2[2],
                                                                        showTmpEFX1[3], showTmpEFX2_1[3], showTmpEFX2_2[3]);
                        ssd1306_display_text(&dev, 1, efct, 17, false);
                    }
                    ssd1306_display_text(&dev, 6, ten, 16, false);
                    // ssd1306_display_text(&dev, 5, one, 16, false);
                    if (!mute[0]) {
                    for (x = 0; x < 32; x++) {
                        _ssd1306_line(&dev, x, 32, x, (uint8_t)(((buffer_ch[0][(x + (contr * 128)) * 2]) / 256) + 32)&63, false);
                        if (period[0]) {
                            _ssd1306_pixel(&dev, x, (uint8_t)(period[0] * (64.0f / 743.0f))&63, false);
                        }
                        volTemp = (vol[0]/2) % 64;
                        _ssd1306_line(&dev, addr[0], 8, addr[0], 47, false);
                        if (x < volTemp) {
                            _ssd1306_line(&dev, x, 58, x, 63, false);
                        }
                    }} else {
                        _ssd1306_line(&dev, 0, 0, 31, 63, false);
                        _ssd1306_line(&dev, 31, 0, 0, 63, false);
                    }
                    if (!mute[1]) {
                    for (x = 32; x < 64; x++) {
                        _ssd1306_line(&dev, x, 32, x, (uint8_t)(((buffer_ch[1][(x + (contr * 128)) * 2]) / 256) + 32)&63, false);
                        if (period[1]) {
                            _ssd1306_pixel(&dev, x, (uint8_t)(period[1] * (64.0f / 743.0f))&63, false);
                        }
                        volTemp = vol[1]/2;
                        _ssd1306_line(&dev, addr[1]+32, 8, addr[1]+32, 47, false);
                        if (x - 32 < volTemp) {
                            _ssd1306_line(&dev, x, 58, x, 63, false);
                        }
                    }} else {
                        _ssd1306_line(&dev, 32, 0, 63, 63, false);
                        _ssd1306_line(&dev, 63, 0, 32, 63, false);
                    }
                    if (!mute[2]) {
                    for (x = 64; x < 96; x++) {
                        _ssd1306_line(&dev, x, 32, x, (uint8_t)(((buffer_ch[2][(x + (contr * 128)) * 2]) / 256) + 32)&63, false);
                        if (period[2]) {
                            _ssd1306_pixel(&dev, x, (uint8_t)(period[2] * (64.0f / 743.0f))&63, false);
                        }
                        volTemp = vol[2]/2;
                        _ssd1306_line(&dev, addr[2]+64, 8, addr[2]+64, 47, false);
                        if (x - 64 < volTemp) {
                            _ssd1306_line(&dev, x, 58, x, 63, false);
                        }
                    }} else {
                        _ssd1306_line(&dev, 64, 0, 95, 63, false);
                        _ssd1306_line(&dev, 95, 0, 64, 63, false);
                    }
                    if (!mute[3]) {
                    for (x = 96; x < 128; x++) {
                        _ssd1306_line(&dev, x, 32, x, (uint8_t)(((buffer_ch[3][(x + (contr * 128)) * 2]) / 256) + 32)&63, false);
                        if (period[3]) {
                            _ssd1306_pixel(&dev, x, (uint8_t)(period[3] * (64.0f / 743.0f))&63, false);
                        }
                        volTemp = vol[3]/2;
                        _ssd1306_line(&dev, addr[3]+96, 8, addr[3]+96, 47, false);
                        if (x - 96 < volTemp) {
                            _ssd1306_line(&dev, x, 58, x, 63, false);
                        }
                    }} else {
                        _ssd1306_line(&dev, 96, 0, 127, 63, false);
                        _ssd1306_line(&dev, 127, 0, 96, 63, false);
                    }
                    ssd1306_show_buffer(&dev);
                    vTaskDelay(1);
                }
            } 
        }
    }
}
// OSC END -------------------------------------------------------

inline void read_part_data(uint8_t** tracker_data, uint8_t pattern_index, uint8_t row_index, uint8_t channel_index, uint16_t part_data[4]) {
    uint8_t* pattern_data = tracker_data[pattern_index];

    uint16_t byte_index = row_index * NUM_CHANNELS * 4 + channel_index * 4;
    // Byte structure for tracker data:
    // +----------------+--------------+----------------+-------------+
    // |    byte 1      |    byte 2    |     byte 3     |    byte 4   |
    // |----------------|--------------|----------------|-------------|
    // | 0000       0000|00000000      | 0000       0000|00000000     |
    // |________________|______________|________________|_____________|
    // | Upper four     | 12 bits for  | Lower four     | Effect      |
    // | bits of sample | note period. | bits of sample | command.    |
    // | number.        |              | number.        |             |
    // +----------------+--------------+----------------+-------------+

