Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
    uint8_t byte1 = pattern_data[byte_index];
    uint8_t byte2 = pattern_data[byte_index + 1];
    uint8_t byte3 = pattern_data[byte_index + 2];
    uint8_t byte4 = pattern_data[byte_index + 3];

    // part_data[ROW][CHAN][NOTE_DATA]
    //                          |
    //                          |- 0: Amiga period
    //                          |- 1: Sample number
    //                          |- 2: Effect1 (Eee)
    //                          +- 3: Effect2 (eEE)
    part_data[0] = ((byte1 & 0x0F) << 8) | byte2;
    part_data[1] = (byte1 & 0xF0) | (byte3 >> 4);
    part_data[2] = (byte3 & 0x0F);
    part_data[3] = byte4;
}

void write_part_data(uint8_t **tracker_data, uint8_t pattern_index, uint8_t chl, uint8_t row, uint16_t row_data[4]) {
    uint8_t* pattern_data = tracker_data[pattern_index];

    uint16_t byte_index = row * NUM_CHANNELS * 4 + chl * 4;

    pattern_data[byte_index] = (row_data[1] & 0xF0) | ((row_data[0] >> 8) & 0x0F);
    pattern_data[byte_index + 1] = row_data[0] & 0xFF;
    pattern_data[byte_index + 2] = (row_data[1] << 4) | (row_data[2] & 0x0F);
    pattern_data[byte_index + 3] = row_data[3];
}

// AUDIO DATA COMP START ----------------------------------------
uint8_t arpNote[2][4] = {0};
float arpFreq[3][4];
int8_t lastVol[4];
float sin_index;
inline float make_data(float freq, uint8_t vole, uint8_t chl, bool isLoop, uint16_t loopStart, uint16_t loopLen, uint8_t smp_num, uint16_t smp_size, bool isline, bool isCos, bool isCubic) {
    if (vole == 0 || freq <= 0 || mute[chl] || tracker_data_sample[smp_num] == NULL) {
        if (config.enbDelay[chl]) return audioDelay(0, 2048, 0.23f, 0.8f, 0.2f, chl);
        else return 0;
    }

    data_index[chl] += freq / SMP_RATE;

    if (isLoop) {
        while (data_index[chl] >= (loopStart + loopLen)) {
            data_index[chl] -= loopLen;
        }
    } else if (data_index[chl] >= smp_size) {
        vol[chl] = 0;
        return 0;
    }

    int idx = (int)data_index[chl];
    int16_t sample1 = (tracker_data_sample[smp_num][idx] * (vole << 1));
    float result;

    if ((isline && isCos) || (isline && isCubic) || (isCos && isCubic)) {
        isCubic = false;
        isline = false;
        isCos = false;
    }

    if (isline) {
        int nextIdx = idx + 1;
        if (nextIdx >= smp_size) {
            nextIdx = isLoop ? loopStart : 0;
        }
        int16_t sample2 = (tracker_data_sample[smp_num][nextIdx] * (vole << 1));
        float frac = data_index[chl] - idx;
        result = (1.0f - frac) * sample1 + frac * sample2;
    } else if (isCos) {
        int nextIdx = idx + 1;
        if (nextIdx >= smp_size) {
            nextIdx = isLoop ? loopStart : 0;
        }
        int16_t sample2 = (tracker_data_sample[smp_num][nextIdx] * (vole << 1));
        float frac = data_index[chl] - idx;
        float f_t = (1 - cosf(M_PI_F * frac)) / 2;
        result = (1.0f - f_t) * sample1 + f_t * sample2;
    } else if (isCubic) {
        int prevIdx = idx - 1;
        int nextIdx1 = idx + 1;
        int nextIdx2 = idx + 2;
        if (prevIdx < 0) {
            prevIdx = isLoop ? loopStart + loopLen - 1 : 0;
        }
        if (nextIdx1 >= smp_size) {
            nextIdx1 = isLoop ? loopStart : 0;
        }
        if (nextIdx2 >= smp_size) {
            nextIdx2 = isLoop ? loopStart + (nextIdx2 - smp_size) : 0;
        }
        int16_t y0 = (tracker_data_sample[smp_num][prevIdx] * (vole << 1));
        int16_t y1 = sample1;
        int16_t y2 = (tracker_data_sample[smp_num][nextIdx1] * (vole << 1));
        int16_t y3 = (tracker_data_sample[smp_num][nextIdx2] * (vole << 1));
        float frac = data_index[chl] - idx;
        result = y1 + 0.5f * frac * (y2 - y0 + frac * (2.0f * y0 - 5.0f * y1 + 4.0f * y2 - y3 + frac * (3.0f * (y1 - y2) + y3 - y0)));
    } else {
        result = sample1;
    }

    if (config.enbFltr[chl]) {
        result = lowPassFilterSingleSample(result, chl, config.cutOffFreq[chl], SMP_RATE);
    }
    if (config.enbDelay[chl]) {
        result = audioDelay(result, 2048, 0.23f, 0.8f, 0.2f, chl);
    }

    return result;
}

// AUDIO DATA COMP END ------------------------------------------

// float frq[CHL_NUM] = {0};

uint16_t part_buffer[4];

bool skipToNextPart = false;
uint8_t skipToAnyPart = false;
bool lcdOK = false;
uint8_t BPM = 125;
uint8_t SPD = 6;
/*
bool keyOK = false;
bool keyUP = false;
bool keyDOWN = false;
bool keyL = false;
bool keyR = false;
bool keySpace = false;
*/
int8_t ChlPos = 0;
// bool ChlMenu = false;
int8_t ChlMenuPos = 0;
int8_t ChlMenuPos_last = 0;
bool windowsClose = true;
int8_t MenuPos = 2;
TaskHandle_t SOUND_ENG;
TaskHandle_t LOAD;
bool partUP = false;
bool partDOWN = false;

#define NUM_RANGES 3
#define NOTES_PER_RANGE 12
uint16_t midi_period_table[NUM_RANGES][NOTES_PER_RANGE] = {
    // C-1 to B-1
    {856, 808, 762, 720, 678, 640, 604, 570, 538, 508, 480, 453},
    // C-2 to B-2
    {428, 404, 381, 360, 339, 320, 302, 285, 269, 254, 240, 226},
    // C-3 to B-3
    {214, 202, 190, 180, 170, 160, 151, 143, 135, 127, 120, 113}
};

typedef struct {
    const uint16_t frequency;
    const char *note_name;
} Note;

Note period_table[NUM_RANGES][NOTES_PER_RANGE] = {
    // C-1 to B-1
    {{856, "C-1"}, {808, "C#1"}, {762, "D-1"}, {720, "D#1"}, {678, "E-1"}, {640, "F-1"},
        {604, "F#1"}, {570, "G-1"}, {538, "G#1"}, {508, "A-1"}, {480, "A#1"}, {453, "B-1"}},
    // C-2 to B-2
    {{428, "C-2"}, {404, "C#2"}, {381, "D-2"}, {360, "D#2"}, {339, "E-2"}, {320, "F-2"},
        {302, "F#2"}, {285, "G-2"}, {269, "G#2"}, {254, "A-2"}, {240, "A#2"}, {226, "B-2"}},
    // C-3 to B-3
    {{214, "C-3"}, {202, "C#3"}, {190, "D-3"}, {180, "D#3"}, {170, "E-3"}, {160, "F-3"},
        {151, "F#3"}, {143, "G-3"}, {135, "G#3"}, {127, "A-3"}, {120, "A#3"}, {113, "B-3"}}
};

const char* findNote(int frequency) {
    int low, high, mid;
    for (int i = 0; i < NUM_RANGES; ++i) {
        low = 0;
        high = NOTES_PER_RANGE - 1;
        while (low <= high) {
            mid = low + (high - low) / 2;
            if (period_table[i][mid].frequency == frequency) {
                return period_table[i][mid].note_name;
            } else if (period_table[i][mid].frequency < frequency) {
                high = mid - 1;
            } else {
                low = mid + 1;
            }
        }
    }
    return "???";
}

QueueHandle_t popUpEventQueue;

