Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
typedef struct {
    char *msg;
    uint8_t w;
    uint8_t h;
    uint16_t time;
} popUpEvent_t;

Animation popUpAnim;
popUpEvent_t popUpEvent;

inline void refsPopUp() {
    frame.fillRect(popUpAnim.getAnimationX(), popUpAnim.getAnimationY(), popUpEvent.w, popUpEvent.h, 0x4208);
    frame.drawRect(popUpAnim.getAnimationX(), popUpAnim.getAnimationY(), popUpEvent.w, popUpEvent.h, ST7735_WHITE);
    frame.setCursor(popUpAnim.getAnimationX()+7, popUpAnim.getAnimationY()+6);
    frame.setTextColor(0x7bcf);
    frame.print(popUpEvent.msg);
    frame.setCursor(popUpAnim.getAnimationX()+6, popUpAnim.getAnimationY()+5);
    frame.setTextColor(ST7735_WHITE);
    frame.print(popUpEvent.msg);
}

void popUpTask(void *arg) {
    for (;;) {
        if (xQueueReceive(popUpEventQueue, &popUpEvent, portMAX_DELAY) == pdTRUE) {
            PopUpExist = true;
            printf("RECEIVED POPUP EVENT!\n");
            popUpEvent.w = (strlen(popUpEvent.msg)*6)+12;
            popUpEvent.h = 18;
            popUpAnim.initAnimation(160, 128, 160-popUpEvent.w-12, 100, 24);
            for (uint8_t i = 0; i < 22; i++) {
                popUpAnim.nextAnimation(6);
                vTaskDelay(10);
            }
            vTaskDelay(popUpEvent.time);
            popUpAnim.initAnimation(160-popUpEvent.w-12, 100, 160, 128, 24);
            for (uint8_t i = 0; i < 22; i++) {
                popUpAnim.nextAnimation(6);
                vTaskDelay(10);
            }
            vTaskDelay(4);
            printf("ANIM END!\n");
            PopUpExist = false;
        }
    }
}

inline int8_t sendPopUpEvent(const char *msg, uint16_t time) {
    popUpEvent_t popUpEventMsg;
    popUpEventMsg.msg = (char*)msg;
    popUpEventMsg.time = time;
    printf("SEND A POPUP EVENT!\n");
    xQueueSend(popUpEventQueue, &popUpEventMsg.msg, 0);
    return 0;
}

char* fileSelect(const char* root_path) {
    // playStat = false;
    char path[256];
    uint8_t path_depth = 0;
    int16_t SelPos = 0;
    int16_t SelPos_last = 0;
    uint8_t pg = 0;
    FileInfo* files = NULL;
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    sprintf(path, "%s", root_path);
    printf("%s\n", path);
    int count = list_directory(path, &files);
    bool emyDir = false;
    key_event_t optionKeyEvent;

    bool CurChange = true;
    uint8_t AnimStep = 0;

    Animation AnimMenu = Animation();

    for (;;) {
        char* showBuf;
        frame.fillRect(0, 10, 160, 118, ST7735_BLACK);
        frame.setCursor(0, 11);
        frame.printf("OPEN FILE IN\n");
        // frame.setCursor(0, 20);
        if (count < 0) {
            frame.printf("Failed to list directory.\n");
            return (char*)"FAIL";
        }
        showBuf = shortenFileName(path, 12);
        // shortenFileName(root_path, 12, showBuf);
        frame.printf("%s: %d FILE/DIR\n", showBuf, count);
        free(showBuf);

        if (CurChange) {
            if (!AnimStep) {
                AnimMenu.initAnimation(0, ((SelPos_last)*10)+28, 0, ((SelPos%10)*10)+28, 16);
                printf("INIT! STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f\n", AnimMenu.startX, AnimMenu.startY, AnimMenu.endX, AnimMenu.endY);
            }
            // printf("STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f X=%d Y=%d\n", startX, startY, endX, endY, getAnimationX(), getAnimationY());
            frame.fillRect(AnimMenu.getAnimationX(), AnimMenu.getAnimationY(), 160, 11, 0x528a);
            AnimMenu.nextAnimation(10);
            AnimStep++;
            if (AnimStep >= 16) {
                CurChange = false;
                AnimStep = 0;
            }
        } else {
            frame.fillRect(0, ((SelPos%10)*10)+28, 160, 11, 0x528a);
        }

        frame.drawFastHLine(0, 27, 160, 0xa6bf);
        frame.setCursor(frame.getCursorX(), frame.getCursorY()+3);
        frame.drawFastVLine(134, 28, 100, 0xa6bf);
        if (count) {
            pg = SelPos / 10;
            for (uint16_t i = 0; i < 10; i++) {
                uint16_t showPos = i+(pg*10);
                if (showPos >= count) {
                    break;
                }
                showBuf = shortenFileName(files[showPos].name, 22);
                frame.printf("%s", showBuf);
                frame.setCursor(138, frame.getCursorY());
                frame.printf("%s\n", files[showPos].is_directory ? "DIR" : "FIL");
                frame.setCursor(frame.getCursorX(), frame.getCursorY()+2);
                free(showBuf);
            }
        } else {            
            frame.printf("Empty directory\n");
            frame.setCursor(frame.getCursorX(), frame.getCursorY()+2);
            frame.printf("..");
            SelPos = 1;
            emyDir = true;
        }
        frame.display();
        vTaskDelay(2);
        if (readOptionKeyEvent == pdTRUE) { if (optionKeyEvent.status == KEY_ATTACK) {
            switch (optionKeyEvent.num) {
            case KEY_L:
                if (path_depth > 0) {
                    for (uint16_t i = 0; i < count; i++) {
                        free(files[i].name);
                    }
                    free(files);
                    files = NULL;
                    char *lastSlash = strrchr(path, '/'); // 查找最后一个斜杠
                    if (lastSlash != NULL) {
                        *lastSlash = '\0'; // 将最后一个斜杠替换为字符串结束符
                    }
                    emyDir = false;
                    count = list_directory(path, &files);
                    printf("%s\n", path);
                    path_depth--;
                    SelPos = 0;
                    AnimStep = 0;
                    CurChange = true;
                } else {
                    for (uint16_t i = 0; i < count; i++) {
                        free(files[i].name);
                    }
                    free(files);
                    return NULL;
                }
                break;
            case KEY_UP:
                SelPos_last = SelPos % 10;
                SelPos--;
                if (SelPos < 0) {
                    SelPos = count-1;
                }
                AnimStep = 0;
                CurChange = true;
                break;
            case KEY_DOWN:
                SelPos_last = SelPos % 10;
                SelPos++;
                if (SelPos > count-1) {
                    SelPos = 0;
                }
                AnimStep = 0;
                CurChange = true;
                break;
            }
            if (optionKeyEvent.num == KEY_OK) {
                if (emyDir) {
                    char *lastSlash = strrchr(path, '/'); // 查找最后一个斜杠
                    if (lastSlash != NULL) {
                        *lastSlash = '\0'; // 将最后一个斜杠替换为字符串结束符
                    }
                    emyDir = false;
                    count = list_directory(path, &files);
                    printf("%s\n", path);
                    SelPos = 0;
                    path_depth--;
                    continue;
                }
                if (files[SelPos].is_directory) {
                    if (strlen(path)+strlen(files[SelPos].name) > 255) {
                        printf("PATH TO LONG\n");
                        continue;
                    }
                    path_depth++;
                    printf("PATH %p\n", path);
                    sprintf(path, "%s/%s", path, files[SelPos].name);
                    // strcat(path, "/");
                    // strcat(path, files[SelPos].name);
                    for (uint16_t i = 0; i < count; i++) {
                        free(files[i].name);
                    }
                    free(files);
                    files = NULL;
                    count = list_directory(path, &files);
                    printf("%s\n", path);
                    SelPos = 0;
                    AnimStep = 0;
                    CurChange = true;
                } else {
                    break;
                }
            }
        }}
    }
    uint16_t *snap = (uint16_t*)malloc(160*128*sizeof(uint16_t));
    memcpy(snap, frame.lcd_buffer, 160*128*sizeof(uint16_t));
    Animation Anim = Animation();
    Anim.initAnimation(0, -80, 0, 0, 32);
    for (uint8_t i = 0; i < 26; i++) {
        frame.drawRGBBitmap(0, 0, snap, 160, 128);
        fillMidRectOfst(80, 20, 0x4208, Anim.getAnimationX(), Anim.getAnimationY());
        drawMidRectOfst(80, 20, ST7735_WHITE, Anim.getAnimationX(), Anim.getAnimationY());
        setMidCusrOfst(80, 20, Anim.getAnimationX()+7, Anim.getAnimationY()+7);
        // printf("GET ANIM(INT) %d %d %d\n", i, 148, 20);
        frame.setTextColor(0x7bcf);
        frame.printf("READING...");
        setMidCusrOfst(80, 20, Anim.getAnimationX()+6, Anim.getAnimationY()+6);
        frame.setTextColor(ST7735_WHITE);
        frame.printf("READING...");
        frame.display();
        Anim.nextAnimation(8);
    }
    free(snap);
    char* full_path = (char*)malloc(strlen(files[SelPos].name) + strlen(path) + 2);
    sprintf(full_path, "%s/%s", path, files[SelPos].name);
    for (uint16_t i = 0; i < count; i++) {
        free(files[i].name);
    }
    free(files);
    files = NULL;
    return full_path;
}

inline void MainReDraw() {
    frame.fillScreen(ST7735_BLACK);
    frame.setTextWrap(false);
    frame.setTextSize(1);
    frame.setTextColor(0x2945);
    frame.setCursor(2, 2);
    frame.print("ESP32Tracker");
    frame.setTextColor(0x7bcf);
    frame.setCursor(1, 1);
    frame.print("ESP32Tracker      libchara");
    frame.setTextColor(ST7735_WHITE);
    frame.setCursor(0, 0);
    frame.print("ESP32Tracker");
    frame.setTextColor(ST7735_WHITE);
    frame.setTextSize(0);
}

int8_t fileOpt() {
    key_event_t optionKeyEvent;
    for (;;) {
        char *fileName = fileSelect("/sdcard");
        if (fileName == NULL) {
            free(fileName);
            return -1;
        }
        playStat = false;
        dispReadingFileError = false;
        dispReadingFile = true;
        vTaskSuspend(SOUND_ENG);
        memset(buffer, 0, BUFF_SIZE * sizeof(audio16BitStro));
        i2s_zero_dma_buffer(I2S_NUM_0);
        int8_t ret = read_tracker_file(fileName);
        free(fileName);
        uint16_t *snap = (uint16_t*)malloc(160*128*sizeof(uint16_t));
        memcpy(snap, frame.lcd_buffer, 160*128*sizeof(uint16_t));
        Animation Anim0 = Animation();
        Animation Anim1 = Animation();
        if (ret == -1) {
            dispReadingFileError = true;
            Anim0.initAnimation(0, -80, 0, 0, 32);
            Anim1.initAnimation(0, 0, 0, -80, 32);
            for (uint8_t i = 0; i < 24; i++) {
                frame.drawRGBBitmap(0, 0, snap, 160, 128);
                fillMidRectOfst(148, 20, 0x4208, Anim0.getAnimationX(), Anim0.getAnimationY());
                drawMidRectOfst(148, 20, ST7735_WHITE, Anim0.getAnimationX(), Anim0.getAnimationY());
                setMidCusrOfst(148, 20, Anim0.getAnimationX()+7, Anim0.getAnimationY()+7);
                // printf("GET ANIM(INT) %d %d %d\n", i, 148, 20);
                frame.setTextColor(0x7bcf);
                frame.printf("THIS IS NOT A MOD FILE!");
                setMidCusrOfst(148, 20, Anim0.getAnimationX()+6, Anim0.getAnimationY()+6);
                frame.setTextColor(ST7735_WHITE);
                frame.printf("THIS IS NOT A MOD FILE!");
                frame.display();
                // printf("%d ANIM %d\n", i, Anim0.getAnimationY());
                Anim0.nextAnimation(8);
            }
            while(readOptionKeyEvent != pdTRUE) {
                frame.display();
                vTaskDelay(8);
            }
            for (uint8_t i = 0; i < 24; i++) {
                frame.drawRGBBitmap(0, 0, snap, 160, 128);
                fillMidRectOfst(148, 20, 0x4208, Anim1.getAnimationX(), Anim1.getAnimationY());
                drawMidRectOfst(148, 20, ST7735_WHITE, Anim1.getAnimationX(), Anim1.getAnimationY());
                setMidCusrOfst(148, 20, Anim1.getAnimationX()+7, Anim1.getAnimationY()+7);
                // printf("GET ANIM(INT) %d %d %d\n", i, 148, 20);
                frame.setTextColor(0x7bcf);
                frame.printf("THIS IS NOT A MOD FILE!");
                setMidCusrOfst(148, 20, Anim1.getAnimationX()+6, Anim1.getAnimationY()+6);
                frame.setTextColor(ST7735_WHITE);
                frame.printf("THIS IS NOT A MOD FILE!");
                frame.display();
                // printf("%d ANIM %d\n", i, Anim1.getAnimationY());
                Anim1.nextAnimation(8);
            }
            MainReDraw();
        } else if (ret == -2) {
            dispReadingFileError = true;
            Anim0.initAnimation(0, -80, 0, 0, 32);
            Anim1.initAnimation(0, 0, 0, -80, 32);
            for (uint8_t i = 0; i < 24; i++) {
                frame.drawRGBBitmap(0, 0, snap, 160, 128);
                fillMidRectOfst(148, 20, 0x4208, Anim0.getAnimationX(), Anim0.getAnimationY());
                drawMidRectOfst(148, 20, ST7735_WHITE, Anim0.getAnimationX(), Anim0.getAnimationY());
                setMidCusrOfst(148, 20, Anim0.getAnimationX()+7, Anim0.getAnimationY()+7);
                // printf("GET ANIM(INT) %d %d %d\n", i, 148, 20);
                frame.setTextColor(0x7bcf);
                frame.printf("THIS FILE IS TOO LARGE!");
                setMidCusrOfst(148, 20, Anim0.getAnimationX()+6, Anim0.getAnimationY()+6);
                frame.setTextColor(ST7735_WHITE);
                frame.printf("THIS FILE IS TOO LARGE!");
                frame.display();
                printf("%d ANIM %d\n", i, Anim0.getAnimationY());
                Anim0.nextAnimation(8);
            }
            while(readOptionKeyEvent != pdTRUE) {
                frame.display();
                vTaskDelay(8);
            }
            for (uint8_t i = 0; i < 24; i++) {
                frame.drawRGBBitmap(0, 0, snap, 160, 128);
                fillMidRectOfst(148, 20, 0x4208, Anim1.getAnimationX(), Anim1.getAnimationY());
                drawMidRectOfst(148, 20, ST7735_WHITE, Anim1.getAnimationX(), Anim1.getAnimationY());
                setMidCusrOfst(148, 20, Anim1.getAnimationX()+7, Anim1.getAnimationY()+7);
                // printf("GET ANIM(INT) %d %d %d\n", i, 148, 20);
                frame.setTextColor(0x7bcf);
                frame.printf("THIS FILE IS TOO LARGE!");
                setMidCusrOfst(148, 20, Anim1.getAnimationX()+6, Anim1.getAnimationY()+6);
                frame.setTextColor(ST7735_WHITE);
                frame.printf("THIS FILE IS TOO LARGE!");
                frame.display();
                printf("%d ANIM %d\n", i, Anim1.getAnimationY());
                Anim1.nextAnimation(8);
            }
            MainReDraw();
        } else {
            dispReadingFileError = false;
            Animation Anim = Animation();
            Anim.initAnimation(0, 0, 0, 128, 32);
            for (uint8_t i = 0; i < 30; i++) {
                frame.fillScreen(ST7735_BLACK);
                frame.drawRGBBitmap(0, Anim.getAnimationY(), snap, 160, 128);
                // printf("%d ANIM %d\n", i, Anim.getAnimationY());
                Anim.nextAnimation(9);
                frame.display();
            }
            free(snap);
            break;
        }
        free(snap);
    }
    vTaskResume(SOUND_ENG);
    dispReadingFile = false;
    return 0;
}

