Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
void loadFileInit() {
    if (fileOpt()) {windowsClose = true; goto loadRef;}
    playStat = false;
    part_point = 0;
    row_point = 0;
    data_index[0] = data_index[1] = data_index[2] = data_index[3] = 0;
    mute[0] = mute[1] = mute[2] = mute[3] = 0;
    period[0] = period[1] = period[2] = period[3] = 0;
    frq[0] = frq[1] = frq[2] = frq[3] = 0;
    read_pattern_table(tracker_data_header);
    read_samp_info(tracker_data_header);
    windowsClose = true;
    row_point = 0;

loadRef:
    MainReDraw();
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.drawFastHLine(0, 18, 160, 0xe71c);
    frame.fillRect(113, 19, 47, 7, 0xa514);
    frame.drawFastVLine(112, 19, 24, ST7735_WHITE);
    frame.fillRect(0, 10, 160, 8, 0x2104);
}

void newFileInit() {
    part_point = 0;
    row_point = 0;
    data_index[0] = data_index[1] = data_index[2] = data_index[3] = 0;
    mute[0] = mute[1] = mute[2] = mute[3] = 0;
    period[0] = period[1] = period[2] = period[3] = 0;
    frq[0] = frq[1] = frq[2] = frq[3] = 0;
    new_tracker_file();
    read_pattern_table(tracker_data_header);
    read_samp_info(tracker_data_header);
    windowsClose = true;
    MainReDraw();
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.drawFastHLine(0, 18, 160, 0xe71c);
    frame.fillRect(113, 19, 47, 7, 0xa514);
    frame.drawFastVLine(112, 19, 24, ST7735_WHITE);
    frame.fillRect(0, 10, 160, 8, 0x2104);
    row_point = 0;
}

uint16_t showTmpNote;
uint8_t showTmpSamp;
uint8_t showTmpEFX1;
uint8_t showTmpEFX2_1;
uint8_t showTmpEFX2_2;

void windowsMenu(const char *title, uint8_t current_option, uint8_t current_last, uint8_t total_options, uint8_t Xlen, Animation& menuAnim, bool CurChange, uint8_t animStep, ...) {
    va_list args;
    va_start(args, Xlen);
    uint8_t OriginX = frame.getCursorX();
    uint8_t OriginY = frame.getCursorY();
    uint8_t Ylen = ((total_options)*11)+18;
    fillMidRect(Xlen, Ylen, 0x4208);
    drawMidRect(Xlen, Ylen, ST7735_WHITE);
    frame.setTextColor(0x7bcf);
    setMidCusr(Xlen, Ylen, 3);
    frame.printf("%s", title);
    frame.setTextColor(ST7735_WHITE);
    setMidCusr(Xlen, Ylen, 2);
    frame.printf("%s\n", title);
    setMidCusr(Xlen, Ylen, 2);
    uint8_t CXTmp = frame.getCursorX()+4;
    frame.setCursor(CXTmp, frame.getCursorY()+14);

    if (CurChange) {
        if (!animStep) {
            menuAnim.initAnimation(frame.getCursorX()-2, (frame.getCursorY()-2)+((current_last-1)*11),
                frame.getCursorX()-2, (frame.getCursorY()-2)+((current_option-1)*11), 16);
            printf("INIT! STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f\n", menuAnim.startX, menuAnim.startY, menuAnim.endX, menuAnim.endY);
        }
        // printf("STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f X=%d Y=%d\n", menuAnim.startX, menuAnim.startY, menuAnim.endX, menuAnim.endY, menuAnim.getAnimationX(), menuAnim.getAnimationY());
        frame.fillRect(menuAnim.getAnimationX(), menuAnim.getAnimationY(), Xlen - 10, 11, 0x7bef);
        menuAnim.nextAnimation(12);
    } else {
        frame.fillRect(frame.getCursorX()-2, (frame.getCursorY()-2)+((current_option-1)*11), Xlen - 10, 11, 0x7bef);
    }

    for (uint8_t q = 0; q < total_options; q++) {
        frame.printf("%s\n", va_arg(args, const char *));
        frame.setCursor(CXTmp, frame.getCursorY()+3);
    }
    va_end(args);
    frame.setCursor(OriginX, OriginY);
}

int8_t windowsMenuBlocking(const char *title, uint8_t total_options, uint8_t opt_init_val, uint8_t Xlen, ...) {
    key_event_t optionKeyEvent;
    va_list args;
    va_start(args, Xlen);
    uint8_t OriginX = frame.getCursorX();
    uint8_t OriginY = frame.getCursorY();
    uint8_t Ylen = ((total_options+1)*11)+18;
    int8_t current_option = opt_init_val;
    int8_t current_last = opt_init_val;
    char * menuStr[total_options];
    for (uint8_t i = 0; i < total_options; i++) {
        menuStr[i] = (char *)va_arg(args, const char *);
    }
    bool CurChange = false;
    uint8_t AnimStep = 0;
    Animation AnimMenu = Animation();
    va_end(args);
    for (;;) {
        fillMidRect(Xlen, Ylen, 0x4208);
        drawMidRect(Xlen, Ylen, ST7735_WHITE);
        frame.setTextColor(0x7bcf);
        setMidCusr(Xlen, Ylen, 3);
        frame.printf("%s", title);
        frame.setTextColor(ST7735_WHITE);
        setMidCusr(Xlen, Ylen, 2);
        frame.printf("%s\n", title);
        setMidCusr(Xlen, Ylen, 2);
        uint8_t CXTmp = frame.getCursorX()+4;
        frame.setCursor(CXTmp, frame.getCursorY()+14);
        if (CurChange) {
            if (!AnimStep) {
                AnimMenu.initAnimation(frame.getCursorX()-2, (frame.getCursorY()-2)+((current_last-1)*11),
                    frame.getCursorX()-2, (frame.getCursorY()-2)+((current_option-1)*11), 16);
                printf("INIT! STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f\n", AnimMenu.startX, AnimMenu.startY, AnimMenu.endX, AnimMenu.endY);
            }
            // printf("STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f X=%d Y=%d\n", startX, startY, endX, endY, getAnimationX(), getAnimationY());
            frame.fillRect(AnimMenu.getAnimationX(), AnimMenu.getAnimationY(), Xlen - 10, 11, 0x7bef);
            AnimMenu.nextAnimation(10);
            AnimStep++;
            if (AnimStep > 14) {
                CurChange = false;
                AnimStep = 0;
            }
        } else {
            frame.fillRect(frame.getCursorX()-2, (frame.getCursorY()-2)+((current_option-1)*11), Xlen - 10, 11, 0x7bef);
        }
        for (uint8_t q = 0; q < total_options; q++) {
            frame.printf("%s\n", menuStr[q]);
            frame.setCursor(CXTmp, frame.getCursorY()+3);
        }
        frame.printf("Close");
        if (readOptionKeyEvent == pdTRUE) { if (optionKeyEvent.status == KEY_ATTACK) {
            switch (optionKeyEvent.num)
            {
            case KEY_UP:
                current_last = current_option;
                current_option--;
                if (current_option < 1) current_option = total_options+1;
                CurChange = true;
                AnimStep = 0;
                break;
            case KEY_DOWN:
                current_last = current_option;
                current_option++;
                if (current_option > total_options+1) current_option = 1;
                CurChange = true;
                AnimStep = 0;
                break;
            }
            if (optionKeyEvent.num == 5) {
                frame.setCursor(OriginX, OriginY);
                if (current_option == total_options+1) break;
                else return current_option - 1;
            }
        }}
        frame.display();
        vTaskDelay(2);
    }
    frame.setCursor(OriginX, OriginY);
    return -1;
}

void MainPage() {
    // if (fromOtherPage) {fromOtherPage = false;xTaskCreatePinnedToCore(backlightCtrlFast, "BACKLIGHT++", 2048, NULL, 1, NULL, 0);}
    uint8_t sideMenu = 0;
    uint8_t fileMenu = 0;
    uint8_t fileMenu_last = 0;
    uint16_t viewTmp[4];
    key_event_t optionKeyEvent;
    key_event_t touchPadEvent;
    BaseType_t PerStat = pdFALSE;
    bool fnA = false;
    bool fnB = false;
    bool fnC = false;
    // uint8_t test = 0;
    Animation AnimMenu = Animation();
    uint8_t animStep = 0;
    bool CurChange = false;

    MainReDraw();
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.drawFastHLine(0, 18, 160, 0xe71c);
    frame.fillRect(113, 19, 47, 7, 0xa514);
    frame.drawFastVLine(112, 19, 24, ST7735_WHITE);
    frame.fillRect(0, 10, 160, 8, 0x2104);

