Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
    for (;;) {
        PerStat = readOptionKeyEvent;
        frame.setCursor(0, 10);
        frame.print(song_name);

        if (PerStat == pdTRUE) {
            if (optionKeyEvent.num == KEY_A) {
                if (optionKeyEvent.status == KEY_ATTACK) fnA = true;
                else fnA = false;
            } else
            if (optionKeyEvent.num == KEY_C) 
                if (optionKeyEvent.status == KEY_ATTACK) editMod = !editMod;
        }

        // printf("FnA STAT %d\n", fnA);

        if (PerStat == pdTRUE && optionKeyEvent.num == KEY_SPACE) {
            PerStat = pdFALSE;
            if (!playStat) row_point = 0;
            playStat = !playStat;
        }

        if (!ChlMenuPos && !sideMenu) {
            if (readTouchPadKeyEvent == pdTRUE) if (editMod && touchPadEvent.status == KEY_ATTACK) {
                uint16_t tmpData[4];
                read_part_data(tracker_data_pattern, part_table[part_point], ChlPos-1, row_point, tmpData);
                tmpData[0] = midi_period_table[inputOct][touchPadEvent.num];
                tmpData[1] = smp_num[ChlPos-1];
                write_part_data(tracker_data_pattern, part_table[part_point], ChlPos-1, row_point, tmpData);
            }
            if (PerStat == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
                PerStat = pdFALSE;
                if (optionKeyEvent.num == KEY_OK) {
                    if (ChlPos) ChlMenuPos = 1;
                    else sideMenu = 1;
                }
                switch (optionKeyEvent.num)
                {
                case KEY_UP:
                    if (fnA) inputOct++;
                    else row_point--;
                    break;
                
                case KEY_DOWN:
                    if (fnA) inputOct--;
                    else row_point++;
                    break;

                case KEY_L:
                    ChlPos--;
                    if (ChlPos < 0) ChlPos = 4;
                    break;
                
                case KEY_R:
                    ChlPos++;
                    if (ChlPos > 4) ChlPos = 0;
                }
            }
        }

        if (windowsClose) {
            windowsClose = false;
            frame.fillRect(0, 24, 160, 30, ST7735_BLACK);
            frame.fillRect(113, 19, 47, 7, 0xa514);

            // SIDE MENU
            frame.drawFastHLine(0, 40, 112, 0xe71c);
            frame.drawFastVLine(37, 40, 15, 0xe71c);
            frame.drawFastVLine(74, 40, 15, 0xe71c);
            frame.drawFastVLine(0, 40, 15, 0xe71c);
            frame.drawFastVLine(111, 40, 15, 0xe71c);

            // TRACKER LINE
            frame.drawFastHLine(0, 54, 160, ST7735_WHITE);

            // PAT VIEW LINE
            frame.drawFastVLine(112, 19, 35, ST7735_WHITE);
            frame.drawFastHLine(0, 55, 160, 0xa514);
            printf("ReDraw\n");
        }

        //----------------------MAIN PAGE-------------------------
        if (ChlPos == 0 && !sideMenu) {
            frame.fillRect(0, 56, 13, 72, 0x630c);
        } else {
            frame.fillRect(0, 56, 13, 72, 0x2945);
        }
        for (uint8_t x = 1; x < 5; x++) {
            if (ChlPos == x) {
                frame.fillRect(((x-1)*36)+15, 56, 33, 72, 0x630c);
            } else if (mute[x-1]) {
                frame.fillRect(((x-1)*36)+15, 56, 33, 72, 0xa514);
            } else {
                frame.fillRect(((x-1)*36)+15, 56, 33, 72, 0x2945);
            }
        }

        frame.drawRect(0, 87, 160, 9, editMod ? 0xfc51 : 0x529f);

        // TRACKER CHL LINE
        frame.drawFastVLine(156, 56, 72, 0x4a51);
        frame.drawFastVLine(157, 56, 72, 0x6b7e);
        frame.drawFastVLine(158, 56, 72, 0xad7f);
        frame.drawFastVLine(159, 56, 72, 0xa514);

        frame.drawFastVLine(12, 56, 72, 0x4a51);
        frame.drawFastVLine(13, 56, 72, 0x6b7e);
        frame.drawFastVLine(14, 56, 72, 0xad7f);

        frame.drawFastVLine(48, 56, 72, 0x4a51);
        frame.drawFastVLine(49, 56, 72, 0x6b7e);
        frame.drawFastVLine(50, 56, 72, 0xad7f);

        frame.drawFastVLine(84, 56, 72, 0x4a51);
        frame.drawFastVLine(85, 56, 72, 0x6b7e);
        frame.drawFastVLine(86, 56, 72, 0xad7f);

        frame.drawFastVLine(120, 56, 72, 0x4a51);
        frame.drawFastVLine(121, 56, 72, 0x6b7e);
        frame.drawFastVLine(122, 56, 72, 0xad7f);

        frame.setCursor(116, 29);
        frame.fillRect(115, 28, 21, 25, 0x2104);
        if (sideMenu == 4) {
            frame.fillRect(137, 28, 21, 25, 0x630c);
        } else {
            frame.fillRect(137, 28, 21, 25, 0x2104);
        }
        frame.drawRect(114, 27, 45, 27, 0xa514);
        frame.fillRect(115, 36, 43, 9, 0x7bcf);
        frame.drawRect(113, 26, 47, 29, ST7735_WHITE);
        frame.drawFastVLine(136, 28, 25, 0xd69a);

        for (int8_t i = -1; i < 2; i++) {
            if ((part_point+i >= 0) && (part_point+i < NUM_PATTERNS)) {
                frame.printf("%3d %3d\n", part_point+i, part_table[part_point+i]);
            } else {
                frame.printf("\n");
            }
            frame.setCursor(116, frame.getCursorY());
        }
        frame.setCursor(0, 56);
        for (int8_t i = -4; i < 5; i++) {
            if ((row_point+i < 64) && (row_point+i >= 0)) {
                frame.setTextColor(0xf7be);
                frame.printf(row_point+i < 10 ? "0%d" : "%d", row_point+i);
                for (uint8_t chl = 0; chl < 4; chl++) {
                    read_part_data(tracker_data_pattern, part_table[part_point], row_point+i, chl, viewTmp);
                    showTmpNote = viewTmp[0];
                    showTmpSamp = clamp(viewTmp[1], 0, 33);

                    frame.setCursor(frame.getCursorX()+4, frame.getCursorY());
                    if (showTmpNote) {
                        frame.setTextColor(0xa51f);
                        frame.printf("%3s", findNote(showTmpNote));
                    } else {
                        frame.setTextColor(0x52aa);
                        frame.printf("...");
                    }
                    frame.setCursor(frame.getCursorX()+2, frame.getCursorY());
                    if (showTmpSamp) {
                        frame.setTextColor(0x2c2a);
                        frame.printf("%2d", showTmpSamp);
                    } else {
                        frame.setTextColor(0x52aa);
                        frame.printf("..");
                    }
                }
                frame.printf("\n");
            } else {
                frame.printf("\n");
            }
        }
        read_part_data(tracker_data_pattern, part_table[part_point], row_point, ChlPos-1, viewTmp);
        frame.setTextColor(ST7735_WHITE);

        frame.fillRect(0, 19, 112, 21, 0x3186);
        frame.setCursor(1, 20);
        frame.printf("BPM: %3d  FCT: %2d", BPM, inputOct+1);

        frame.setCursor(1, 28);
        frame.printf("SPD: %2d   SMP: %2d", SPD, ChlPos > 0 ? smp_num[ChlPos-1] : 0);

        if (sideMenu) {
            for (uint8_t i = 0; i < 3; i++) {
                if (sideMenu-1 == i) {
                    frame.fillRect(1+(i*37), 41, 36, 13, 0x630c);
                } else {
                    frame.fillRect(1+(i*37), 41, 36, 13, 0x2945);
                }
            }

            if (fileMenu) {
                windowsMenu("FILE", fileMenu, fileMenu_last, 5, 80, AnimMenu, CurChange, animStep, "New", "Open", recMod ? "Recording..." : "Record", "Setting", "Close");
                animStep++;
                if (animStep > 14) {
                    CurChange = false;
                    animStep = 0;
                }
                if (PerStat == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
                    PerStat = pdFALSE;
                    switch (optionKeyEvent.num)
                    {
                    case KEY_UP:
                        fileMenu_last = fileMenu;
                        fileMenu--;
                        if (fileMenu < 1) fileMenu = 5;
                        CurChange = true;
                        animStep = 0;
                        break;
                    
                    case KEY_DOWN:
                        fileMenu_last = fileMenu;
                        fileMenu++;
                        if (fileMenu > 5) fileMenu = 1;
                        CurChange = true;
                        animStep = 0;
                        break;
                    }
                    if (optionKeyEvent.num == KEY_OK) {
                        printf("KEY_OK PUSHED!\n");
                        if (fileMenu == 5) {
                            fileMenu = 0;
                            windowsClose = true;
                        }
                        if (fileMenu == 4) {
                            MenuPos = 3;
                            break;
                        }
                        if (fileMenu == 3 && !recMod) {
                            playStat = false;
                            printf("SAVE!\n");
                            vTaskDelay(8);
                            // memset(buffer, 0, 6892 * sizeof(int16_t));
                            char *export_wave_name = (char*)malloc(strlen(song_name)+32);
                            sprintf(export_wave_name, "/sdcard/%s_record.wav", song_name);
                            export_wav_file = wav_audio_start(export_wave_name, SMP_RATE, 16, 2);
                            recMod = true;
                            vTaskDelay(8);
                            free(export_wave_name);
                            playStat = true;
                        }
                        if (fileMenu == 2) {
                            // playStat = false;
                            sideMenu = 0;
                            fileMenu = 0;
                            loadFileInit();
                        }
                        if (fileMenu == 1) {
                            playStat = false;
                            vTaskDelay(16);
                            sideMenu = 0;
                            fileMenu = 0;
                            newFileInit();
                        }
                        fileMenu_last = 0;
                        CurChange = false;
                        animStep = 0;
                    }
                }
            }

            if (PerStat == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
                PerStat = pdFALSE;
                switch (optionKeyEvent.num)
                {
                case KEY_DOWN:
                    if (sideMenu == 4) partDOWN = true;
                    break;

                case KEY_UP:
                    if (sideMenu == 4) partUP = true;
                    break;

