Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
                case KEY_L:
                    sideMenu--;
                    if (sideMenu < 1) sideMenu = 4;
                    break;

                case KEY_R:
                    sideMenu++;
                    if (sideMenu > 4) sideMenu = 1;
                    break;
                }
                // printf("S2 %d\n", optionKeyEvent.num);
                if (optionKeyEvent.num == KEY_OK) {
                    printf("KEYOK OK!\n");
                    if (sideMenu == 3) {
                        printf("SAMP\n");
                        MenuPos = 5;
                        break;
                    }
                    if (sideMenu == 2) {
                        // mute[ChlPos-1] = !mute[ChlPos-1];
                        fileMenu = 1;
                    }
                    if (sideMenu == 1) {
                        printf("CLOSE SIDEMENU\n");
                        sideMenu = 0;
                        windowsClose = true;
                    }
                }
            }
        }

        frame.setCursor(6, 44);
        frame.printf("CHAN");
        if (!fileMenu) {
        frame.setCursor(44, 44);
        frame.printf("FILE");
        frame.setCursor(82, 44);
        frame.printf("SAMP");}

        if (ChlMenuPos) {
            char menuShow[13];
            sprintf(menuShow, "CHL%d OPTION", ChlPos);
            windowsMenu(menuShow, ChlMenuPos, ChlMenuPos_last, 3, 90, AnimMenu, CurChange, animStep, mute[ChlPos-1] ? "unMute" : "Mute", "CHL Editor", "Close");
            animStep++;
            if (animStep > 14) {
                CurChange = false;
                animStep = 0;
            }
            if (PerStat == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
                PerStat = pdFALSE;
                switch (optionKeyEvent.num)
                {
                case KEY_UP:
                    ChlMenuPos_last = ChlMenuPos;
                    ChlMenuPos--;
                    if (ChlMenuPos < 1) ChlMenuPos = 3;
                    CurChange = true;
                    animStep = 0;
                    break;
                
                case KEY_DOWN:
                    ChlMenuPos_last = ChlMenuPos;
                    ChlMenuPos++;
                    if (ChlMenuPos > 3) ChlMenuPos = 1;
                    CurChange = true;
                    animStep = 0;
                    break;

                case KEY_L:
                    ChlPos--;
                    if (ChlPos < 1) ChlPos = 4;
                    break;

                case KEY_R:
                    ChlPos++;
                    if (ChlPos > 4) ChlPos = 1;
                    break;
                }
                if (optionKeyEvent.num == KEY_OK) {
                    if (ChlMenuPos == 3) {
                        ChlMenuPos = 0;
                        windowsClose = true;
                        ChlMenuPos_last = 0;
                        CurChange = false;
                        animStep = 0;
                    }
                    if (ChlMenuPos == 1) mute[ChlPos-1] = !mute[ChlPos-1];
                    if (ChlMenuPos == 2) {
                        MenuPos = 1;
                        break;
                    }
                }
            }
        }

        //----------------------MAIN PAGH-------------------------
        //----------------------KEY STATUS------------------------
        frame.display();
    }
}

void ChlEdit() {
    frame.setTextSize(2);
    frame.setCursor(0, 12);
    frame.printf("CHL%d", ChlPos);
    frame.setTextSize(0);
    frame.drawFastVLine(77, 0, 128, 0x4a51);
    frame.drawFastVLine(78, 0, 128, 0x6b7e);
    frame.drawFastVLine(79, 0, 128, 0xad7f);
    int8_t EditPos = 0;
    uint16_t viewTmp[4];
    bool enbRec = false;
    key_event_t optionKeyEvent;
    for (;;) {
        frame.fillRect(0, 40, 77, 88, ST7735_BLACK);
        frame.fillRect(0, 40, vol[ChlPos-1], 8, (((vol[ChlPos-1]>>1) << 11) | (clamp(vol[ChlPos-1], 0, 63) << 5) | (vol[ChlPos-1]>>1)));//0x8578);
        frame.setFont(&font3x5);
        frame.setTextColor(0xef9d);
        frame.setCursor(0, 69);
        frame.printf("VOLE:%d\nPROD:%d\nFREQ:%.1f\n", vol[ChlPos-1], period[ChlPos-1], frq[ChlPos-1]);
        frame.setTextColor(0x8410);
        frame.printf("SAMP INFO\nNAME:\n%s\nNUM: %d\nLEN: %d\nFTV: %d\nVOL: %d", samp_info[smp_num[ChlPos-1]].name, smp_num[ChlPos-1], samp_info[smp_num[ChlPos-1]].len<<1, samp_info[smp_num[ChlPos-1]].finetune, samp_info[smp_num[ChlPos-1]].vol);
        frame.setFont(&abcd);

        vTaskDelay(2);

        // HIGH LIGHT
        if (EditPos == 0) {
            frame.fillRect(80, 0, 13, 128, 0x528a);
            frame.fillRect(80, 55, 13, 9, 0x7bcf);
        } else {
            frame.fillRect(80, 0, 13, 128, 0x2945);
            frame.fillRect(80, 55, 13, 9, 0x528a);
        }
        if (EditPos == 1) {
            frame.fillRect(96, 0, 23, 128, 0x528a);
            frame.fillRect(96, 55, 23, 9, 0x7bcf);
        } else {
            frame.fillRect(96, 0, 23, 128, 0x2945);
            frame.fillRect(96, 55, 23, 9, 0x528a);
        }
        if (EditPos == 2) {
            frame.fillRect(119, 0, 18, 128, 0x528a);
            frame.fillRect(119, 55, 18, 9, 0x7bcf);
        } else {
            frame.fillRect(119, 0, 18, 128, 0x2945);
            frame.fillRect(119, 55, 18, 9, 0x528a);
        }
        if (EditPos == 3) {
            frame.fillRect(137, 0, 9, 128, 0x528a);
            frame.fillRect(137, 55, 9, 9, 0x7bcf);
        } else {
            frame.fillRect(137, 0, 9, 128, 0x2945);
            frame.fillRect(137, 55, 9, 9, 0x528a);
        }
        if (EditPos == 4) {
            frame.fillRect(146, 0, 13, 128, 0x528a);
            frame.fillRect(146, 55, 13, 9, 0x7bcf);
        } else {
            frame.fillRect(146, 0, 13, 128, 0x2945);
            frame.fillRect(146, 55, 13, 9, 0x528a);
        }

        frame.setCursor(81, 0);
        for (int8_t i = -7; i < 9; i++) {
            if ((row_point+i < 64) && (row_point+i >= 0)) {
                frame.setTextColor(0xf7be);
                frame.printf(row_point+i < 10 ? "0%d" : "%d", row_point+i);
                read_part_data(tracker_data_pattern, part_table[part_point], row_point+i, ChlPos-1, viewTmp);
                
                showTmpNote = viewTmp[0];
                showTmpSamp = viewTmp[1];
                showTmpEFX1 = viewTmp[2];
                showTmpEFX2_1 = hexToDecimalTens(viewTmp[3]);
                showTmpEFX2_2 = hexToDecimalOnes(viewTmp[3]);
                
