Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
                frame.setCursor(frame.getCursorX()+5, frame.getCursorY());
                if (showTmpNote) {
                    frame.setTextColor(0xcdff);
                    frame.printf("%s ", findNote(showTmpNote));
                } else {
                    frame.setTextColor(0x52aa);
                    frame.printf("... ");
                }
                if (showTmpSamp) {
                    frame.setTextColor(0x97f2);
                    frame.printf("%2d ", showTmpSamp);
                } else {
                    frame.setTextColor(0x52aa);
                    frame.printf(".. ");
                }
                if (showTmpEFX1 || showTmpEFX2_1 || showTmpEFX2_2) {
                    frame.setTextColor(0xfc8f);
                    frame.printf("%1X", showTmpEFX1);
                    frame.setTextColor(0xff14);
                    frame.printf("%1X%1X", showTmpEFX2_1, showTmpEFX2_2);
                } else {
                    frame.setTextColor(0x52aa);
                    frame.printf("...");
                }
                frame.printf("\n");
                frame.setCursor(81, frame.getCursorY());
            } else {
                frame.printf("\n");
                frame.setCursor(81, frame.getCursorY());
            }
        }
        frame.drawFastVLine(93, 0, 128, 0x9492);
        frame.drawFastVLine(94, 0, 128, 0xb5b6);
        frame.drawFastVLine(95, 0, 128, 0xad7f);
        frame.drawFastVLine(159, 0, 128, 0xc618);
        frame.display();
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            if (optionKeyEvent.num == KEY_OK) {
                MenuPos = 0;
                break;
            }
            switch (optionKeyEvent.num)
            {
            case KEY_UP:
                row_point--;
                break;
            
            case KEY_DOWN:
                row_point++;
                break;
            
            case KEY_L:
                EditPos--;
                if (EditPos < 0) EditPos = 4;
                break;
            
            case KEY_R:
                EditPos++;
                if (EditPos > 4) EditPos = 0;
                break;

            case KEY_SPACE:
                playStat = !playStat;
                break;
            }
        }
        vTaskDelay(1);
    }
}

int parseWavHeader(FILE* file, WavHeader_t* header) {

    fread(header, sizeof(WavHeader_t), 1, file);

    // 检查文件格式
    if (header->chunkID[0] != 'R' || header->chunkID[1] != 'I' || 
        header->chunkID[2] != 'F' || header->chunkID[3] != 'F' ||
        header->format[0] != 'W' || header->format[1] != 'A' ||
        header->format[2] != 'V' || header->format[3] != 'E') {
        printf("Error: Not a valid WAV file.\n");
        fclose(file);
        return -1;
    }

    return 0;
}

void wav_player() {
    vTaskSuspend(SOUND_ENG);
    view_mode = true;
    key_event_t optionKeyEvent;
    FILE *wave_file;
    size_t bytes_read;
    buffer = realloc(buffer, 10240);
    buffer16BitStro = (audio16BitStro*)buffer;
    memset(buffer, 0, 2560 * sizeof(audio16BitStro));
    if (audio_master_write(buffer, 1, sizeof(audio16BitStro), 2560) != 0) exit(-1);
    i2s_zero_dma_buffer(I2S_NUM_0);
    char *wave_file_name = fileSelect("/sdcard");
    wave_file = fopen(wave_file_name, "rb");
    free(wave_file_name);
    WavHeader_t header;
    parseWavHeader(wave_file, &header);
    i2s_set_clk(I2S_NUM_0, header.sampleRate, header.bitsPerSample, (i2s_channel_t)header.numChannels);
    printf("WAV File Information:\n");
    printf("Sample Rate: %u Hz\n", header.sampleRate);
    printf("Channels: %u\n", header.numChannels);
    printf("Bits Per Sample: %u\n", header.bitsPerSample);
    size_t writeing;
    frame.fillScreen(ST7735_BLACK);
    frame.setTextColor(ST7735_WHITE);
    frame.setCursor(0, 0);
    frame.printf("PLAYING...\n\n\n\n\n");
    frame.setTextColor(0x52aa);
    frame.printf("WAV File Information:\nSample Rate: %u Hz\nBits Per Sample: %u\nChannels: %u", header.sampleRate, header.bitsPerSample, header.numChannels);
    frame.setTextColor(ST7735_WHITE);
    frame.display();
    static float i2s_vol = 1.0f;
    uint16_t read_p;
    uint8_t refs_p = 0;
    while (!feof(wave_file)) {
        read_p = fread(buffer16BitStro, 1, 10240, wave_file);
        if (refs_p > 1) {
            refs_p = 0;
            frame.fillRect(0, 10, 128, 20, ST7735_BLACK);
            frame.setCursor(0, 10);
            frame.printf("POS(INT8)=%d\nTIME(S)=%f", ftell(wave_file), ftell(wave_file)/(float)(header.sampleRate*4));
            frame.display();
        }
        for (uint16_t s = 0; s < 2560; s++) {
            buffer16BitStro[s].dataL *= i2s_vol;
            buffer16BitStro[s].dataR *= i2s_vol;
        }
        /*
        wave_MAX_L_OUT = wave_MAX_L / 2560;
        wave_MAX_L = 0;
        wave_MAX_R_OUT = wave_MAX_R / 2560;
        wave_MAX_R = 0;
        MAX_COMP_FINISH = true;
        */
        // i2s_write(I2S_NUM_0, buffer, 10240, &writeing, portMAX_DELAY);
        if (audio_master_write(buffer, header.numChannels, sizeof(audio16BitStro), 2560) != 0) exit(-1);
        // printf("%d %d L=%5d R=%5d\n", writeing, read_p, wave_MAX_L_OUT, wave_MAX_R_OUT);
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            switch (optionKeyEvent.num)
            {
            case KEY_L:
                fseek(wave_file, -10240*16, SEEK_CUR);
                break;
            
            case KEY_R:
                fseek(wave_file, 10240*16, SEEK_CUR);
                break;

            case KEY_UP:
                i2s_vol += 0.05f;
                printf("%.2f\n", i2s_vol);
                break;

            case KEY_DOWN:
                i2s_vol -= 0.05f;
                printf("%.2f\n", i2s_vol);
                break;
            }
            if (optionKeyEvent.num == KEY_OK) {
                i2s_vol = 1.0f;
                break;
            }
        }
        refs_p++;
        vTaskDelay(1);
    }
    buffer = realloc(buffer, BUFF_SIZE * sizeof(audio16BitStro));
    buffer16BitStro = (audio16BitStro*)buffer;
    memset(buffer, 0, BUFF_SIZE * sizeof(audio16BitStro));
    fclose(wave_file);
    vTaskDelay(16);
    i2s_zero_dma_buffer(I2S_NUM_0);
    i2s_set_clk(I2S_NUM_0, SMP_RATE, I2S_BITS_PER_CHAN_16BIT, I2S_CHANNEL_STEREO);
    MenuPos = 0;
    vTaskResume(SOUND_ENG);
    view_mode = false;
    vTaskDelay(64);
}

void filterSetting() {
    MainReDraw();
    frame.setFont(&font3x5);
    int8_t fltrPos = 0;
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.fillRect(0, 10, 160, 118, ST7735_BLACK);
    frame.setCursor(1, 11);
    frame.setTextSize(2);
    frame.fillRect(0, 10, 160, 16, 0x39c7);
    frame.printf("FILTERS\n");
    frame.setTextSize(0);
    frame.drawFastHLine(0, 26, 160, 0xa6bf);
    key_event_t optionKeyEvent;
    for (;;) {
        frame.fillRect(0, 27, 160, 107, ST7735_BLACK);
        frame.setCursor(0, 31);
        frame.setTextSize(2);
        if (fltrPos) frame.fillRect(0, (fltrPos*26)+26, 160, 25, 0x528a);
        else frame.fillRect(0, (fltrPos*26)+27, 160, 24, 0x528a);
        frame.drawFastVLine(48, 27, 101, ST7735_WHITE);
        for (uint8_t i = 0; i < NUM_CHANNELS; i++) {
            frame.printf("CHL%d\n", i+1);
            frame.setCursor(0, frame.getCursorY()+10);
            frame.drawFastHLine(0, frame.getCursorY()-6, 160, ST7735_WHITE);
        }
        frame.setTextSize(0);
        frame.setCursor(52, 31);
        for (uint8_t i = 0; i < NUM_CHANNELS; i++) {
            frame.printf("STATUS: %s\n", config.enbFltr[i] ? "ON" : "OFF");
            frame.setCursor(52, frame.getCursorY());
            frame.printf("CUTOFF: %.1fHz\n", config.cutOffFreq[i]);
            frame.setCursor(52, frame.getCursorY()+10);
        }
        frame.display();
        vTaskDelay(4);
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            if (optionKeyEvent.num == KEY_L) {
                fltrPos--;
                if (fltrPos < 0) {MenuPos = 3; break;};
            }
            switch (optionKeyEvent.num)
            {
            case KEY_R:
                fltrPos++;
                if (fltrPos > 3) fltrPos = 0;
                break;
            
            case KEY_UP:
                config.cutOffFreq[fltrPos]+=500;
                break;

            case KEY_DOWN:
                config.cutOffFreq[fltrPos]-=500;
                break;
            
            case KEY_OK:
                config.enbFltr[fltrPos] = !config.enbFltr[fltrPos];
                break;
            }
        }
    }
    frame.setFont(&abcd);
}

