Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
uint32_t prevSampStart;
uint32_t prevSampEnd;
uint8_t prevSampChl;
uint8_t prevBitsPreSamp;

void prevSamp(void *arg) {
    vTaskSuspend(SOUND_ENG);
    memset(buffer, 0, BUFF_SIZE*sizeof(audio16BitStro));
    i2s_zero_dma_buffer(I2S_NUM_0);
    static uint32_t prevSampStart;
    static uint32_t prevSampEnd;
    FILE *sampFile = (FILE *) arg;
    long filePosBak = ftell(sampFile);
    fseek(sampFile, 44+prevSampStart, SEEK_SET);
    
    vTaskDelete(NULL);
}

void* importSamp(int8_t *sampData) {
    char *filePath = fileSelect("/sdcard");
    if (filePath == NULL) {
        free(filePath);
        return NULL;
    }
    key_event_t optionKeyEvent;
    FILE *sampFile = fopen(filePath, "rb");
    WavHeader_t header;
    printf("File Name: %s\n", filePath);
    free(filePath);
    if (parseWavHeader(sampFile, &header)) {
        printf("Read Error!\n");
        fclose(sampFile);
        return NULL;
    }
    int8_t snap[160];
    fseek(sampFile, 0, SEEK_END);
    size_t fileEnd = ftell(sampFile) - 44;
    fseek(sampFile, 44, SEEK_SET);
    uint32_t cutStart = 0;
    uint32_t cutLen = 1;
    bool playing = false;
    TaskHandle_t PREVSAMP;

    printf("INFO:\n");
    printf("Sample Rate: %d\n", header.sampleRate);
    printf("Num Channels: %d\n", header.numChannels);
    printf("Bits Per Sample: %d\n", header.bitsPerSample);
    printf("Sub Chunk2Size: %d\n", header.subchunk2Size);
    prevSampChl = header.numChannels;
    prevBitsPreSamp = header.bitsPerSample;

    // Generate preview data
    uint32_t showCount = roundf(fileEnd / 160.0f);
    printf("\nShowCount: %d\n", showCount);
    if (showCount) {
        frame.setTextColor(0x1082);
        if (header.bitsPerSample == 8) {
            if (header.numChannels == 1) {
                uint8_t *snap2 = (uint8_t*)malloc(4096 * sizeof(uint8_t));
                for (uint8_t i = 0; i < 160; i++) {
                    fread(snap2, 1, 4096, sampFile);
                    fseek(sampFile, showCount, SEEK_CUR);
                    /*
                    if (ftell(sampFile) > header.subchunk2Size) {
                        fseek(sampFile, 0, SEEK_END);
                    }
                    */
                    float tol = 0;
                    for (uint16_t j = 0; j < 4096; j++) {
                        tol += snap2[j]-128;
                        tol /= 2;
                    }
                    snap[i] = tol/2;
                    frame.setCursor(2, 40);
                    frame.fillRect(0, 38, 160, 12, 0xc618);
                    frame.printf("READING %d/%d", ftell(sampFile), fileEnd);
                    frame.display();
                }
                free(snap2);
            } else
            if (header.numChannels == 2) {
                uint8_t *snap2 = (uint8_t*)malloc(4096 * sizeof(uint8_t));
                for (uint8_t i = 0; i < 160; i++) {
                    fread(snap2, 2, 2048, sampFile);
                    fseek(sampFile, showCount, SEEK_CUR);
                    /*
                    if (ftell(sampFile) > header.subchunk2Size) {
                        fseek(sampFile, 0, SEEK_END);
                    }
                    */
                    float tol = 0;
                    for (uint16_t j = 0; j < 2048; j++) {
                        tol += ((snap2[j<<1] + snap2[(j<<1)+1]) >> 1) - 128;
                        tol /= 2;
                    }
                    snap[i] = tol/2;
                    frame.setCursor(2, 40);
                    frame.fillRect(0, 38, 160, 12, 0xc618);
                    frame.printf("READING %d/%d", ftell(sampFile), fileEnd);
                    frame.display();
                }
                free(snap2);
            }
        } else
        if (header.bitsPerSample == 16) {
            if (header.numChannels == 1) {
                int16_t *snap2 = (int16_t*)malloc(2048 * sizeof(int16_t));
                for (uint8_t i = 0; i < 160; i++) {
                    fread(snap2, 2, 2048, sampFile);
                    fseek(sampFile, showCount-4096, SEEK_CUR);
                    /*
                    if (ftell(sampFile) > header.subchunk2Size) {
                        fseek(sampFile, 0, SEEK_END);
                    }
                    */
                    float tol = 0;
                    for (uint16_t j = 0; j < 2048; j++) {
                        tol += snap2[j];
                        tol /= 2;
                    }
                    snap[i] = (tol / 256) / 2;
                    frame.setCursor(2, 40);
                    frame.fillRect(0, 38, 160, 12, 0xc618);
                    frame.printf("READING %d/%d", ftell(sampFile), fileEnd);
                    // printf("header.subchunk2Size %d showCount %d snap[%d] = %d\n", header.subchunk2Size, showCount, i, snap[i]);
                    frame.display();
                }
                free(snap2);
            } else
            if (header.numChannels == 2) {
                int16_t *snap2 = (int16_t*)malloc(2048 * sizeof(int16_t) * 2);
                for (uint8_t i = 0; i < 160; i++) {
                    fread(snap2, 2, 2048 * 2, sampFile);
                    fseek(sampFile, showCount-4096, SEEK_CUR);
                    /*
                    if (ftell(sampFile) > header.subchunk2Size) {
                        fseek(sampFile, 0, SEEK_END);
                    }
                    */
                    float tol = 0;
                    for (uint16_t j = 0; j < 2048; j++) {
                        tol += snap2[j<<1] + snap2[(j<<1)+1];
                        tol /= 2;
                    }
                    snap[i] = (tol / 256) / 2;
                    frame.setCursor(2, 40);
                    frame.fillRect(0, 38, 160, 12, 0xc618);
                    frame.printf("READING %d/%d", ftell(sampFile), fileEnd);
                    // printf("header.subchunk2Size %d showCount %d snap[%d] = %d\n", header.subchunk2Size, showCount, i, snap[i]);
                    frame.display();
                }
                free(snap2);
            }
        }
    } else {
        if (header.bitsPerSample == 8) {
            if (header.numChannels == 1) {
                fread(snap, 1, 160, sampFile);
                for (uint8_t i = 0; i < 160; i++) {
                    snap[i] -= 128;
                    snap[i] /= 2;
                }
            } else
            if (header.numChannels == 2) {
                uint8_t snap2[320];
                fread(snap2, 2, 160, sampFile);
                for (uint8_t i = 0; i < 160; i++) {
                    snap[i] = (snap2[i<<1] + snap2[(i<<1)+1]) >> 1;
                    snap[i] -= 128;
                    snap[i] /= 2;
                }
            }
        } else
        if (header.bitsPerSample == 16) {
            if (header.numChannels == 1) {
                int16_t snap2[160];
                fread(snap2, sizeof(int16_t), 160, sampFile);
                for (uint8_t i = 0; i < 160; i++) {
                    snap[i] = snap2[i] >> 8;
                    snap[i] /= 2;
                }
            } else
            if (header.numChannels == 2) {
                int16_t snap2[320];
                fread(snap2, sizeof(int16_t) * 2, 160, sampFile);
                for (uint8_t i = 0; i < 160; i++) {
                    snap[i] = (snap2[i<<1] + snap2[(i<<1)+1]) >> 9;
                    snap[i] /= 2;
                }
            }
        }
    }

    frame.setTextColor(ST7735_WHITE);

    MainReDraw();
    frame.drawFastHLine(0, 9, 160, 0xe71c);

    frame.fillRect(0, 19, 160, 64, 0x4208);

    frame.drawFastHLine(0, 18, 160, 0xe71c);
    frame.drawFastHLine(0, 19, 160, 0xa514);

    frame.drawFastHLine(0, 83, 160, 0xe71c);
    frame.drawFastHLine(0, 82, 160, 0xa514);

    frame.setCursor(0, 10);
    frame.printf("Import Sample");
    if (showCount) {
        for (uint8_t x = 0; x < 160; x++) {
            uint8_t y = clamp(abs(snap[x]>>1), 0, 32);
            frame.drawFastVLine(x, 51, y, 0xffff);
            frame.drawFastVLine(x, 51, -y, 0xffff);
        }
    } else {
        for (uint8_t x = 0; x < 160; x++) {
            frame.drawFastVLine(x, 51, clamp(snap[x], -32, 32), 0xffff);
        }
    }
    frame.display();
    for (;;) {
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            if (optionKeyEvent.num == KEY_OK) break;
            if (optionKeyEvent.num == KEY_SPACE) {
                if (playing) vTaskDelete(&PREVSAMP);
                else xTaskCreatePinnedToCore(&prevSamp, "Prev Sample", 4096, sampFile, 3, &PREVSAMP, 0);
                playing = !playing;
            }
        }
        vTaskDelay(32);
    }
    fclose(sampFile);
    return NULL;
}

void SampEdit() {
    const uint8_t OPTION_NUM = 6;
    const char *menuStr[OPTION_NUM] = {"New", "Load", "Info", "Next", "Prev", "Close"};
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.drawFastHLine(0, 18, 160, 0xe71c);
    frame.fillRect(0, 10, 160, 8, 0x42d0);
    frame.setCursor(0, 10);
    frame.printf("Sample Editor");
    bool confMenu = false;
    int8_t optPos = 0;
    uint8_t optPos_last = 0;
    uint8_t confPos = 0;
    bool CurChange = true;
    uint8_t AnimStep = 0;
    key_event_t optionKeyEvent;
    Animation AnimMenu = Animation();
    uint8_t show_num = 1;
    bool refresh_data = true;
    int8_t snap[117] = {0};
    uint8_t showLoopStart = 0;
    uint8_t showLoopEnd = 0;
    for (;;) {
        frame.fillRect(0, 19, 160, 44, ST7735_BLACK);
        frame.fillRect(0, 63, 42, 65, ST7735_BLACK);
        frame.drawFastVLine(77, 29, 33, 0xa514);
        frame.drawFastVLine(42, 28, 141, 0xa514);
        frame.drawFastVLine(41, 28, 141, 0xf79e);
        frame.drawFastHLine(0, 28, 160, 0x867f);
        frame.drawFastHLine(42, 63, 118, 0xf79e);
        frame.drawFastHLine(43, 62, 117, 0xa514);
        frame.drawFastVLine(119, 29, 10, 0xa514);
        frame.fillRect(0, 19, 160, 9, 0x2104);

