Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
        if (refresh_data) {
            refresh_data = false;

            if (tracker_data_sample[show_num] != NULL) {
                float showCount = samp_info[show_num].len / 58.5f;

                if (samp_info[show_num].len > 255) {
                    int16_t showFilter = 0;
                    for (uint8_t i = 0; i < 117; i++) {
                        showFilter += tracker_data_sample[show_num][(uint16_t)(i*showCount)-1]>>2;
                        showFilter += tracker_data_sample[show_num][(uint16_t)(i*showCount)]>>2;
                        showFilter += tracker_data_sample[show_num][(uint16_t)(i*showCount)+1]>>2;
                        snap[i] = showFilter / 3;
                        showFilter = 0;
                    }
                } else {
                    for (uint8_t i = 0; i < 117; i++) {
                        snap[i] = tracker_data_sample[show_num][(uint16_t)(i*showCount)]>>2;
                    }
                }
            } else {
                memset(snap, 0, 117);
            }
            if (samp_info[show_num].loopLen > 1) {
                showLoopStart = (uint8_t)((samp_info[show_num].loopStart<<1) * (58.5f / samp_info[show_num].len));
                showLoopEnd = (uint8_t)(((samp_info[show_num].loopStart<<1) + (samp_info[show_num].loopLen<<1)) * (58.5f / samp_info[show_num].len));
                showLoopEnd = showLoopEnd > 116 ? 116 : showLoopEnd;
            } else {
                showLoopStart = showLoopEnd = 0;
            }
        }


        frame.fillRect(43, 64, 117, 64, 0x4208);

        if (samp_info[show_num].len > 255) {
            for (uint8_t x = 0; x < 117; x++) {
                frame.drawFastVLine(43+x, 97, snap[x], 0xffdf);
            }
        } else {
            for (uint8_t x = 0; x < 117; x++) {
                frame.drawFastVLine(43+x, 97, snap[x], 0xffdf);
            }
        }

        if (showLoopEnd) {
            frame.drawFastVLine(43+showLoopStart, 64, 64, 0xfae8);
            frame.drawFastVLine(43+showLoopEnd, 64, 64, 0x429f);
        }

        if (tracker_data_sample[show_num] != NULL) {
            for (uint8_t chl = 0; chl < NUM_CHANNELS; chl++) {
                if (smp_num[chl] == show_num) frame.drawFastVLine(43+(data_index[chl] * (58.5f / samp_info[smp_num[chl]].len)), 64, 64, 0xc618);
            }
        } else {
            frame.setFont(NULL);
            frame.setCursor(80, 82);
            frame.setTextSize(2);
            frame.setTextColor(0);
            frame.print("NULL");
            frame.setTextSize(1);
            frame.setFont(&abcd);
            frame.setTextColor(ST7735_WHITE);
        }

        frame.setCursor(44, 30);
        frame.printf("CONF: VOL %2d FTV %2d", samp_info[show_num].vol, samp_info[show_num].finetune);
        frame.drawFastHLine(43, 38, 117, 0xf79e);
        frame.setCursor(44, 47);

        frame.printf(samp_info[show_num].loopLen > 1 ? "LOOP:" : "LOOP:    DISABLE");
        if (samp_info[show_num].loopLen > 1) {
            frame.drawFastHLine(78, 50, 82, 0xa514);
            frame.setCursor(84, 41);
            frame.printf("START   END");
            frame.setCursor(80, 53);
            frame.printf("%-6d %-6d", samp_info[show_num].loopStart<<1, (samp_info[show_num].loopLen+samp_info[show_num].loopStart)<<1);
            frame.drawFastVLine(119, 39, 24, 0xa514);
        }

        frame.setCursor(0, 20);
        frame.printf(show_num < 10 ? "0%d: %.16s" : "%d: %.16s", show_num, samp_info[show_num].name);

        frame.setCursor(0, 31);
        if (CurChange) {
            if (!AnimStep) {
                AnimMenu.initAnimation(0, (optPos_last*10)+29, 0, (optPos*10)+29, 16);
                printf("INIT! STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f\n", AnimMenu.startX, AnimMenu.startY, AnimMenu.endX, AnimMenu.endY);
            }
            // printf("STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f X=%d Y=%d\n", startX, startY, endX, endY, getAnimationX(), getAnimationY());
            frame.fillRect(AnimMenu.getAnimationX(), AnimMenu.getAnimationY(), 41, 11, 0x528a);
            AnimMenu.nextAnimation(9);
            AnimStep++;
            if (AnimStep > 14) {
                CurChange = false;
                AnimStep = 0;
            }
        } else {
            frame.fillRect(0, (optPos*10)+29, 41, 11, 0x528a);
        }
        for (uint8_t i = 0; i < OPTION_NUM; i++) {
            frame.printf("%s\n", menuStr[i]);
            frame.setCursor(0, frame.getCursorY()+2);
        }
        frame.display();
        vTaskDelay(2);
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            if (optionKeyEvent.num == KEY_OK) {
                if (optPos == 1) {
                    importSamp(tracker_data_sample[show_num]);
                    frame.drawFastHLine(0, 9, 160, 0xe71c);
                    frame.drawFastHLine(0, 18, 160, 0xe71c);
                    frame.fillRect(0, 10, 160, 8, 0x42d0);
                    frame.setCursor(0, 10);
                    frame.printf("Sample Editor");
                }
                if (optPos == 3) {show_num++; if (show_num > 31) show_num = 1;}
                if (optPos == 4) {show_num--; if (show_num < 1) show_num = 31;}
                if (optPos == 5) {
                    MenuPos = 0;
                    break;
                }
                refresh_data = true;
            }
            switch (optionKeyEvent.num)
            {
            case KEY_UP:
                optPos_last = optPos;
                optPos--;
                if (optPos < 0) optPos = OPTION_NUM-1;
                CurChange = true;
                AnimStep = 0;
                break;
            
            case KEY_DOWN:
                optPos_last = optPos;
                optPos++;
                if (optPos >= OPTION_NUM) optPos = 0;
                CurChange = true;
                AnimStep = 0;
                break;
            }
        }
    }
    fromOtherPage = true;
}

void Setting() {
    bool CurChange = true;
    uint8_t AnimStep = 0;

