Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
    const uint8_t SETTING_NUM = 10;
    key_event_t optionKeyEvent;

    const char *menuStr[SETTING_NUM] = {"Interpolation", "Show EFX in OSC", "Filter Setting", "WAV Player", "Save Config", "uwu", "Snake!!!", "Export Config to sdcard", "Import Config from sdcard", "Close"};
    int8_t optPos = 0;
    uint8_t optPos_last = 0;
    frame.drawFastHLine(0, 9, 160, 0xe71c);
    frame.fillRect(0, 10, 160, 118, ST7735_BLACK);
    frame.setCursor(1, 11);
    frame.setTextSize(2);
    frame.fillRect(0, 10, 160, 16, 0x39c7);
    frame.printf("SETTINGS\n");
    frame.setTextSize(0);
    frame.drawFastHLine(0, 26, 160, 0xa6bf);
    Animation AnimMenu = Animation();
    for (;;) {
        frame.fillRect(0, 27, 160, 107, ST7735_BLACK);
        frame.setCursor(0, 29);
        if (CurChange) {
            if (!AnimStep) {
                AnimMenu.initAnimation(0, (optPos_last*10)+27, 0, (optPos*10)+27, 16);
                printf("INIT! STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f\n", AnimMenu.startX, AnimMenu.startY, AnimMenu.endX, AnimMenu.endY);
            }
            // printf("STARTX=%.1f STARTY=%.1f ENDX=%.1f ENDY=%.1f X=%d Y=%d\n", startX, startY, endX, endY, getAnimationX(), getAnimationY());
            frame.fillRect(AnimMenu.getAnimationX(), AnimMenu.getAnimationY(), 160, 11, 0x528a);
            AnimMenu.nextAnimation(10);
            AnimStep++;
            if (AnimStep > 14) {
                CurChange = false;
                AnimStep = 0;
            }
        } else {
            frame.fillRect(0, (optPos*10)+27, 160, 11, 0x528a);
        }
        for (uint8_t i = 0; i < SETTING_NUM; i++) {
            frame.printf("%s\n", menuStr[i]);
            frame.setCursor(0, frame.getCursorY()+2);
        }
        frame.display();
        vTaskDelay(2);
        if (readOptionKeyEvent == pdTRUE) if (optionKeyEvent.status == KEY_ATTACK) {
            if (optionKeyEvent.num == KEY_OK) {
                if (optPos == 0) {
                    int8_t menuRtrn = windowsMenuBlocking(menuStr[optPos], 4, config.enbCubic ? 3 : (config.enbCos ? 2 : (config.enbLine ? 1 : (!config.enbCos && !config.enbLine && !config.enbCubic ? 4 : -1))), 90, "Linear", "Cosine", "Cubic Spline", "OFF");
                    switch (menuRtrn)
                    {
                    case 0:
                        config.enbLine = true;
                        config.enbCubic = config.enbCos = false;
                        break;
                    
                    case 1:
                        config.enbCos = true;
                        config.enbCubic = config.enbLine = false;
                        break;

                    case 2:
                        config.enbCubic = true;
                        config.enbCos = config.enbLine = false;
                        break;

                    case 3:
                        config.enbCubic = config.enbCos = config.enbLine = false;
                        break;
                    }
                    printf("MENU RETURN %d\n", menuRtrn);
                }
                if (optPos == 1) {
                    int8_t menuRtrn = windowsMenuBlocking("Show EFX", 2, dispShowEfct+1, 60, "OFF", "ON");
                    dispShowEfct = menuRtrn != -1 ? menuRtrn : dispShowEfct;
                    printf("MENU RETURN %d\n", dispShowEfct);
                }
                if (optPos == 2) {MenuPos = 4; break;}
                if (optPos == 3) wav_player();
                if (optPos == 4) {
                    if (writeConfig(&config)) sendPopUpEvent("Save Success", 1024);
                    else sendPopUpEvent("Save failed", 1024);
                }
                if (optPos == 5) sendPopUpEvent("uwu", 2048);
                if (optPos == 6) snake_mod = true;
                if (optPos == 7) copyFile(CONFIG_FILE_PATH, "/sdcard/esp32tracker.config");
                if (optPos == 8) {copyFile("/sdcard/esp32tracker.config", CONFIG_FILE_PATH); readConfig(&config);};
                if (optPos == SETTING_NUM - 1) {MenuPos = 0; break;}
            }
            switch (optionKeyEvent.num)
            {
            case KEY_UP:
                optPos_last = optPos;
                optPos--;
                if (optPos < 0) optPos = SETTING_NUM-1;
                CurChange = true;
                AnimStep = 0;
                break;
            
            case KEY_DOWN:
                optPos_last = optPos;
                optPos++;
                if (optPos >= SETTING_NUM) optPos = 0;
                CurChange = true;
                AnimStep = 0;
                break;
            }
        }
    }
    fromOtherPage = true;
}

void RotaryRefs(void *arg) {
    for (;;) {
        rotary.loop();
        vTaskDelay(1);
    }
}

void display_lcd(void *arg) {
    xTaskCreatePinnedToCore(backlightCtrl, "BACKLIGHT++", 2048, NULL, 1, NULL, 0);
    MainReDraw();
    MenuPos = 0;
    read_pattern_table(tracker_data_header);
    read_samp_info(tracker_data_header);
    part_point = 0;
    xTaskCreate(&comp, "Sound Eng", 8192, NULL, 5, &SOUND_ENG);
    xTaskCreate(&RotaryRefs, "Rotary", 1024, NULL, 3, NULL);
    vTaskDelay(32);
    for (;;) {
        if (MenuPos == 0) {
            MainReDraw();
            windowsClose = true;
            MainPage();
        } else if (MenuPos == 1) {
            MainReDraw();
            ChlEdit();
        } else if (MenuPos == 3) {
            MainReDraw();
            Setting();
        }
        else if (MenuPos == 4) {
            MainReDraw();
            filterSetting();
        }
        else if (MenuPos == 5) {
            MainReDraw();
            SampEdit();
        }
    }
}
bool TestNote = false;
uint8_t chlMap[CHL_NUM] = {/*L*/0, 3, /*R*/1, 2};

const int8_t channel_type[8] = {0, 0, 0, 0, 1, 1, 1, 1}; // 0: SAMPLER, 1: SYNTH, 2: UART OUT

void triggerSamplePlayback(int16_t period_input, uint8_t velocity, uint8_t channel, uint16_t sampOfst) {
    if (sampOfst) data_index[channel] = sampOfst;
    else data_index[channel] = 0;

    vol[channel] = velocity;
    period[channel] = period_input;
    // printf("Triggering sample on channel %d with period %d, volume %d\n", channel, period[channel], vol[channel]);
}

void triggerSynthesizer(uint8_t note, uint8_t velocity, uint8_t channel, uint16_t option) {
    printf("Triggering synthesizer for note %d on channel %d with velocity %d\n", note, channel, velocity);
}

void triggerUartNote(uint8_t note, uint8_t velocity, uint8_t channel, uint16_t option) {
    printf("Triggering new type for note %d on channel %d with velocity %d\n", note, channel, velocity);
}

void triggerNote(int16_t period, uint8_t velocity, uint8_t channel, uint16_t options) {
    switch (channel_type[channel]) {
        case 0:
            triggerSamplePlayback(period, velocity, channel, options);
            break;
        case 1:
            triggerSynthesizer(period, velocity, channel, options);
            break;
        case 2:
            triggerUartNote(period, velocity, channel, options);
            break;
        default:
            printf("Unknown channel type for channel %d [%d]\n", channel, channel_type[channel]);
    }
}

// COMP TASK START ----------------------------------------------
void comp(void *arg) {
    uint8_t tick_time = 0;
    uint8_t tick_speed = 6;
    uint8_t arp_p = 0;
    bool enbArp[4] = {false};
    uint8_t volUp[4] = {0};
    uint8_t volDown[4] = {0};
    uint16_t portToneSpeed[4] = {0};
    uint16_t portToneTemp[4] = {0};
    uint16_t portToneSource[4] = {0};
    uint16_t portToneTarget[4] = {0};
    bool enbPortTone[4] = {false};
    uint16_t lastNote[4] = {false};
    bool enbSlideUp[4] = {false};
    uint8_t SlideUp[4] = {false};
    bool enbSlideDown[4] = {false};
    uint8_t SlideDown[4] = {false};
    bool enbVibrato[4] = {false};
    uint8_t VibratoSpeed[4];
    uint8_t VibratoDepth[4];
    uint8_t VibratoPos[4] = {32};
    bool enbTremolo[4] = {false};
    uint8_t TremoloPos[4] = {32};
    uint8_t TremoloSpeed[4] = {0};
    uint8_t TremoloDepth[4] = {0};
    int VibratoItem[4] = {0};
    uint16_t Mtick = 0;
    uint16_t TICK_NUL = roundf(SMP_RATE / (125 * 0.4f));
    buffer = calloc(BUFF_SIZE, sizeof(audio16BitStro));
    // buffer = realloc(buffer, TICK_NUL * sizeof(audio16BitStro));
    for (uint8_t ch = 0; ch < NUM_CHANNELS; ch++) {
        buffer_ch[ch] = (float *)calloc(BUFF_SIZE, sizeof(float));
    }
    buffer16BitStro = (audio16BitStro*)buffer;
    uint8_t volTemp[4];
    uint16_t OfstCfg[4];
    uint8_t rowLoopStart = 0;
    int8_t rowLoopCont = 0;
    bool enbRowLoop = false;
    printf("READ!\n");
    vTaskDelay(128);
    uint8_t chl;
    bool enbRetrigger[4] = {false};
    // uint8_t RetriggerPos[4] = {1};
    uint8_t RetriggerConfig[4] = {0};
    int16_t audio_tempL;
    int16_t audio_tempR;
    int8_t atkTick[4] = {0};
    int8_t cutTick[4] = {0};
    int8_t skipToRow = 0;
    uint16_t buffPtr = 0;
    dispReadConfigStatus = true;
    xTaskCreate(i2s_write_task, "I2S_WRITE", 1024, NULL, 5, &I2S_WRITE_H);
    for(;;) {
        // printf("READ!\n");
        if (playStat) {
            SPD = 6;
            tick_time = 0;
            TICK_NUL = roundf(SMP_RATE / (125 * 0.4f));
            Mtick = 0;
            // buffer = realloc(buffer, TICK_NUL * sizeof(audio16BitStro));
            for (;;) {
                for(chl = 0; chl < 4; chl++) {
                    if (samp_info[smp_num[chl]].loopLen > 1) {
                        buffer_ch[chl][buffPtr] = make_data(frq[chl], vol[chl], chl, true, samp_info[smp_num[chl]].loopStart<<1, samp_info[smp_num[chl]].loopLen<<1, smp_num[chl], samp_info[smp_num[chl]].len<<1, config.enbLine, config.enbCos, config.enbCubic);
                    } else {
                        buffer_ch[chl][buffPtr] = make_data(frq[chl], vol[chl], chl, false, 0, 0, smp_num[chl], samp_info[smp_num[chl]].len<<1, config.enbLine, config.enbCos, config.enbCubic);
                    }
                }
                buffer16BitStro[buffPtr].dataL = (int16_t)
                        roundf(buffer_ch[chlMap[0]][buffPtr]
                                + buffer_ch[chlMap[1]][buffPtr]);
                buffer16BitStro[buffPtr].dataR = (int16_t)
                        roundf(buffer_ch[chlMap[2]][buffPtr]
                                + buffer_ch[chlMap[3]][buffPtr]);
                Mtick++;
                buffPtr++;
                if (buffPtr >= BUFF_SIZE) {
                    buffPtr = 0;
                    // i2s_write(I2S_NUM_0, buffer, BUFF_SIZE*sizeof(audio16BitStro), &wrin, portMAX_DELAY);
                    if (audio_master_write(buffer, 2, sizeof(audio16BitStro), BUFF_SIZE) != 0) exit(-1);
                    // printf("WRIN %d\n", wrin);
                }
                if (Mtick == TICK_NUL) {
                    // pwm_audio_write((uint8_t*)&buffer, Mtick, &wrin, 64);
                    Mtick = 0;
                    tick_time++;
                    arp_p++;
                    if (tick_time != tick_speed) {
                        for(chl = 0; chl < 4; chl++) {
                            if (enbSlideUp[chl]) {
                                // printf("SLIDE UP %d", period[chl]);
                                period[chl] -= SlideUp[chl];
                                enbPortTone[chl] = false;
                                // printf(" - %d = %d\n", SlideUp[chl], period[chl]);
                            }
                            if (enbSlideDown[chl]) {
                                // printf("SLIDE DOWN %d", period[chl]);
                                period[chl] += SlideDown[chl];
                                enbPortTone[chl] = false;
                                // printf(" + %d = %d\n", SlideDown[chl], period[chl]);
                            }
                            vol[chl] += (volUp[chl] - volDown[chl]);
                            vol[chl] = (vol[chl] > 64) ? 64 : (vol[chl] < 1) ? 0 : vol[chl];

                            VibratoItem[chl] = enbVibrato[chl] ? (sine_table[VibratoPos[chl]] * VibratoDepth[chl]) / 128 : 0;
                            VibratoPos[chl] = enbVibrato[chl] ? (VibratoPos[chl] + VibratoSpeed[chl]) & 63 : 0;

