Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
                            if (enbTremolo[chl]) {
                                int tremoloValue = (sine_table[TremoloPos[chl]] * TremoloDepth[chl]) / 128;
                                vol[chl] += tremoloValue;
                                vol[chl] = (vol[chl] > 64) ? 64 : (vol[chl] < 1) ? 0 : vol[chl];
                                // printf("TRE %3d  TREPOS %2d  TRESPD %1d  TREDPH %1d  VOL %3d\n", tremoloValue, TremoloPos[chl], TremoloSpeed[chl], TremoloDepth[chl], vol[chl]);
                                TremoloPos[chl] = (TremoloPos[chl] + TremoloSpeed[chl]) & 63;
                            } else {
                                TremoloPos[chl] = 32;
                            }

                            if (enbPortTone[chl]) {
                                int portToneSpeedValue = portToneSpeed[chl];
                                if (portToneSource[chl] > portToneTarget[chl]) {
                                    period[chl] -= portToneSpeedValue;
                                    period[chl] = (period[chl] < portToneTarget[chl]) ? portToneTarget[chl] : period[chl];
                                    // printf("SIL %d + %d\n", portToneTemp[chl], portToneSpeed[chl]);
                                } else if (portToneSource[chl] < portToneTarget[chl]) {
                                    period[chl] += portToneSpeedValue;
                                    period[chl] = (period[chl] > portToneTarget[chl]) ? portToneTarget[chl] : period[chl];
                                    // printf("SID %d - %d\n", portToneTemp[chl], portToneSpeed[chl]);
                                }
                                // printf("PORTTONE %d to %d. speeed=%d\n", portToneSource[chl], portToneTarget[chl], portToneSpeed[chl]);
                            }
                            if (tick_time == cutTick[chl]) {
                                vol[chl] = 0;
                                cutTick[chl] = 0;
                            }
                        }
                    } else if (tick_time == tick_speed) {
                        tick_time = 0;
                        for (chl = 0; chl < 4; chl++) {
                            read_part_data(tracker_data_pattern, part_table[part_point], row_point, chl, part_buffer);
                            if (part_buffer[2] == 13) {
                                if (part_buffer[3]) {
                                    skipToRow = hexToRow(part_buffer[3]);
                                    printf("SKIP TO NEXT PART'S %d ROW\n", skipToRow);
                                }
                                skipToNextPart = true;
                            }

                            if (part_buffer[2] == 11) {
                                if (part_buffer[3]) {
                                    skipToAnyPart = part_buffer[3];
                                }
                            }

                            if (part_buffer[1]) {
                                smp_num[chl] = part_buffer[1];
                                vol[chl] = samp_info[smp_num[chl]].vol;
                                lastVol[chl] = vol[chl];
                            }

                            if (part_buffer[0]) {
                                if (part_buffer[2] == 3
                                    || part_buffer[2] == 5) {
                                    enbPortTone[chl] = true;
                                    if (part_buffer[0]) {
                                        portToneTarget[chl] = part_buffer[0];
                                        portToneSource[chl] = lastNote[chl];
                                        lastNote[chl] = part_buffer[0];
                                    }
                                    if (enbSlideDown[chl] || enbSlideUp[chl]) {
                                        portToneSource[chl] = period[chl];
                                    }
                                    // printf("PT TARGET SET TO %d. SOURCE IS %d\n", portToneTarget[chl], portToneSource[chl]);
                                    if ((part_buffer[3])
                                            && (part_buffer[2] != 5)) {
                                        portToneSpeed[chl] = part_buffer[3];
                                    }
                                } else {
                                    lastNote[chl] = part_buffer[0];
                                    enbPortTone[chl] = false;
                                    triggerNote(lastNote[chl], lastVol[chl], chl, 0);
                                }
                                if (!(part_buffer[2] == 12) 
                                    && part_buffer[1]) {
                                    vol[chl] = samp_info[smp_num[chl]].vol;
                                    lastVol[chl] = vol[chl];
                                }
                                if (part_buffer[1]) {
                                    smp_num[chl] = part_buffer[1];
                                }
                            } else if (part_buffer[2] == 3 && part_buffer[3]) portToneSpeed[chl] = part_buffer[3];

                            if (part_buffer[2] == 10
                                    || part_buffer[2] == 6
                                        || part_buffer[2] == 5) {
                                if (part_buffer[2] == 10) {
                                    enbPortTone[chl] = false;
                                }
                                if (part_buffer[2] == 5) {
                                    enbPortTone[chl] = true;
                                }
                                volUp[chl] = hexToDecimalTens(part_buffer[3]);
                                volDown[chl] = hexToDecimalOnes(part_buffer[3]);
                                // printf("VOL+=%d -=%d\n", volUp[chl], volDown[chl]);
                            } else {
                                volUp[chl] = volDown[chl] = 0;
                            }

                            if (part_buffer[2] == 1) {
                                SlideUp[chl] = part_buffer[3];
                                // printf("SET SLIDEUP IS %d\n", part_buffer[3]);
                                enbSlideUp[chl] = true;
                            } else {
                                enbSlideUp[chl] = false;
                            }

