Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
                            if (part_buffer[2] == 2) {
                                SlideDown[chl] = part_buffer[3];
                                // printf("SET SLIDEDOWN IS %d\n", part_buffer[3]);
                                enbSlideDown[chl] = true;
                            } else {
                                enbSlideDown[chl] = false;
                            }

                            if (part_buffer[2] == 4
                                    || part_buffer[2] == 6) {
                                enbVibrato[chl] = true;
                                if ((part_buffer[2] == 4)) {
                                    if (hexToDecimalTens(part_buffer[3])) {
                                        VibratoSpeed[chl] = hexToDecimalTens(part_buffer[3]);
                                    }
                                    if (hexToDecimalOnes(part_buffer[3])) {
                                        VibratoDepth[chl] = hexToDecimalOnes(part_buffer[3]);
                                    }
                                    // printf("VIBRATO SPD %d DPH %d\n", VibratoSpeed[chl], VibratoDepth[chl]);
                                }
                                // VibratoPos[chl] = 0;
                            } else {
                                enbVibrato[chl] = false;
                            }

                            if (part_buffer[2] == 7) {
                                enbTremolo[chl] = true;
                                if (hexToDecimalTens(part_buffer[3])) {
                                    TremoloSpeed[chl] = hexToDecimalTens(part_buffer[3]);
                                }
                                if (hexToDecimalOnes(part_buffer[3])) {
                                    TremoloDepth[chl] = hexToDecimalOnes(part_buffer[3]);
                                }
                                // TremoloPos[chl] = 0;
                                // printf("TREMOLO SPD %d DPH %d\n", VibratoSpeed[chl], VibratoDepth[chl]);
                            } else {
                                enbTremolo[chl] = false;
                            }

                            if (part_buffer[2] == 9) {
                                OfstCfg[chl] = part_buffer[3] << 8;
                                // printf("SMP OFST %d\n", OfstCfg[chl]);
                            }

                            if (part_buffer[2] == 12) {
                                vol[chl] = part_buffer[3];
                                lastVol[chl] = vol[chl];
                                enbPortTone[chl] = false;
                            }
                            enbRetrigger[chl] = false;
                            if (part_buffer[2] == 14) {
                                uint8_t decimalTens = hexToDecimalTens(part_buffer[3]);
                                vol[chl] += (decimalTens == 10) ? hexToDecimalOnes(part_buffer[3]) : ((decimalTens == 11) ? -hexToDecimalOnes(part_buffer[3]) : 0);
                                vol[chl] = (vol[chl] > 64) ? 64 : ((vol[chl] < 1) ? 0 : vol[chl]);
                                period[chl] += (decimalTens == 2) ? hexToDecimalOnes(part_buffer[3]) : ((decimalTens == 1) ? -hexToDecimalOnes(part_buffer[3]) : 0);
                                if (decimalTens == 9) {
                                    enbRetrigger[chl] = true;
                                    RetriggerConfig[chl] = hexToDecimalOnes(part_buffer[3]);
                                    // printf("RETRIGGER %d\n", RetriggerConfig[chl]);
                                    volTemp[chl] = vol[chl];
                                } else if (decimalTens == 6) {
                                    if (hexToDecimalOnes(part_buffer[3]) == 0) {
                                        rowLoopStart = row_point;
                                        // printf("SET LOOP START %d\n", rowLoopStart);
                                    } else {
                                        if (rowLoopCont == 0) {
                                            rowLoopCont = hexToDecimalOnes(part_buffer[3]);
                                            // printf("SET LOOP CONT %d\n", rowLoopCont);
                                        } else {
                                            rowLoopCont--;
                                            // printf("LOOP CONT - 1 %d\n", rowLoopCont);
                                        }
                                        if (rowLoopCont > 0) {
                                            // printf("ROWLOOP %d\n", rowLoopCont);
                                            enbRowLoop = true;
                                        }
                                    }
                                } else if (decimalTens == 12) {
                                    cutTick[chl] = hexToDecimalOnes(part_buffer[3]);
                                }
                                // printf("LINE VOL %s TO %d\n", (decimalTens == 10) ? "UP" : ((decimalTens == 11) ? "DOWN" : "UNCHANGED"), vol[chl]);
                            }

                            if (part_buffer[2] == 15) {
                                if (part_buffer[3] < 32) {
                                    tick_speed = part_buffer[3];
                                    SPD = part_buffer[3];
                                    // printf("SPD SET TO %d\n", tick_speed);
                                } else {
                                    BPM = part_buffer[3];
                                    TICK_NUL = roundf(SMP_RATE / (BPM * 0.4f));
                                    // printf("MTICK SET TO %d\n", TICK_NUL);
                                }
                            }

                            if ((!part_buffer[2]) && part_buffer[3]) {
                                arp_p = 0;

                                arpNote[0][chl] = hexToDecimalTens(part_buffer[3]);
                                arpNote[1][chl] = hexToDecimalOnes(part_buffer[3]);

                                arpFreq[0][chl] = patch_table[samp_info[smp_num[chl]].finetune] / period[chl];
                                arpFreq[1][chl] = freq_up(arpFreq[0][chl], arpNote[0][chl]);
                                arpFreq[2][chl] = freq_up(arpFreq[0][chl], arpNote[1][chl]);
                                // printf("ARP CTRL %d %d %f %f %f\n", arpNote[0][chl], arpNote[1][chl], arpFreq[0][chl], arpFreq[1][chl], arpFreq[2][chl]);
                                enbArp[chl] = true;
                            } else {
                                if (enbArp[chl]) {
                                    frq[chl] = arpFreq[0][chl];
                                    enbArp[chl] = false;
                                }
                            }
                            if (vol[chl]) {
                                lastVol[chl] = vol[chl];
                            }
                        }
                        if (partUP) {partUP = false; part_point--; if (part_point < 0) part_point = NUM_PATTERNS-1;}
                        if (partDOWN) {partDOWN = false; part_point++; if (part_point >= NUM_PATTERNS) part_point = 0;}
                        row_point++;
                        if (enbRowLoop) {
                            row_point = rowLoopStart;
                            enbRowLoop = false;
                            printf("SKIP TO %d\n", rowLoopStart);
                        }
                        if ((row_point > 63) || skipToNextPart || skipToAnyPart) {
                            if (skipToRow) {
                                row_point = skipToRow;
                                skipToRow = 0;
                            } else {
                                row_point = 0;
                            }
                            part_point++;
                            if (part_point >= NUM_PATTERNS) {
                                part_point = 0;
                                if (recMod) {
                                    wav_audio_close(export_wav_file);
                                    recMod = false;
                                }
                            }
                            if (skipToAnyPart) {
                                part_point = skipToAnyPart;
                                printf("SKIP TO %d\n", part_point);
                                skipToAnyPart = false;
                                // part_point++;
                            }
                            skipToNextPart = false;
                            printf("NOW %d\n", part_point);
                        }
                    }
                    for (chl = 0; chl < 4; chl++) {
                        if (period[chl] != 0) {
                            frq[chl] = patch_table[samp_info[smp_num[chl]].finetune] / (float)(period[chl] + VibratoItem[chl]);
                        } else {
                            frq[chl] = 0;
                        }
                        if (enbRetrigger[chl]) {
                            // printf("RETPOS %d\n", RetriggerPos[chl]);
                            // if (RetriggerPos[chl] > RetriggerConfig[chl]) {
                            if (!(tick_time % RetriggerConfig[chl])) {
                                // printf("EXEC RET %d\n", RetriggerPos[chl]);
                                triggerNote(period[chl], volTemp[chl], chl, 0);
                            }
                        }
                        if (OfstCfg[chl]) {
                            data_index[chl] = OfstCfg[chl];
                            OfstCfg[chl] = 0;
                        }
                        if (arp_p > 2) {arp_p = 0;}
                        if (enbArp[chl]) {
                            frq[chl] = arpFreq[arp_p][chl];
                        }
                    }
                }
                if (!playStat) {
                    for (uint8_t s = 0; s < 4; s++) {
                        vol[s] = 0;
                        period[s] = 0;
                        frq[s] = 0;
                    }
                    i2s_zero_dma_buffer(I2S_NUM_0);
                    vTaskDelay(1);
                    tick_speed = 6;
                    BPM = 125;
                    TICK_NUL = roundf(SMP_RATE / (BPM * 0.4f));
                    data_index[0] = data_index[1] = data_index[2] = data_index[3] = 0;
                    Mtick = 0;
                    if (recMod) {
                        wav_audio_close(export_wav_file);
                        recMod = false;
                        playStat = false;
                    }
                    break;
                }
            }
        } else {
            for (uint16_t i = 0; i < BUFF_SIZE; i++) {
                if (samp_info[smp_num[0]].loopLen > 1) {
                    buffer_ch[0][i] = buffer_ch[1][i] = buffer_ch[2][i] = buffer_ch[3][i] = make_data(frq[0], vol[0], 0, true, samp_info[smp_num[0]].loopStart<<1, samp_info[smp_num[0]].loopLen<<1, wav_ofst[smp_num[0]], samp_info[smp_num[0]].len<<1, false, false, false);
                } else {
                    buffer_ch[0][i] = buffer_ch[1][i] = buffer_ch[2][i] = buffer_ch[3][i] = make_data(frq[0], vol[0], 0, false, 0, 0, wav_ofst[smp_num[0]], samp_info[smp_num[0]].len<<1, false, false, false);
                }
                buffer16BitStro[i].dataL = (int16_t)
                        (buffer_ch[chlMap[0]][i]
                                + buffer_ch[chlMap[1]][i]);
                buffer16BitStro[i].dataR = (int16_t)
                        (buffer_ch[chlMap[2]][i]
                                + buffer_ch[chlMap[3]][i]);
            }
            if (TestNote) {
                TestNote = false;
                if (period[0]) {
                    printf("TEST CHL0 OFF\n");
                    data_index[0] = 0;
                    period[0] = 0;
                    vol[0] = 0;
                } else {
                    printf("TEST CHL0 428\n");
                    data_index[0] = 0;
                    period[0] = 428;
                    vol[0] = 64;
                }
            }
            if (row_point > 63 || partDOWN) {
                if (!partDOWN) {
                    row_point = 0;
                }
                partDOWN = false;
                part_point++;
                if (part_point >= NUM_PATTERNS) {
                    part_point = 0;
                }
            }
            if (row_point < 0 || partUP) {
                if (!partUP) {
                    row_point = 63;
                }
                partUP = false;
                part_point--;
                if (part_point < 0) {
                    part_point = NUM_PATTERNS-1;
                }
            }
            if (playStat) {
                for (uint8_t s = 0; s < 4; s++) {
                    vol[s] = 0;
                    period[s] = 0;
                    frq[s] = 0;
                }
            }
            // pwm_audio_write((uint8_t*)&buffer, BUFF_SIZE, &wrin, 64);
            frq[0] = patch_table[samp_info[smp_num[0]].finetune] / period[0];
            // i2s_write(I2S_NUM_0, buffer, BUFF_SIZE*sizeof(audio16BitStro), &wrin, portMAX_DELAY);
            if (audio_master_write(buffer, 2, sizeof(audio16BitStro), BUFF_SIZE) != 0) exit(-1);
            vTaskDelay(4);
        }
    }
}
// COMP TASK END ------------------------------------------------

void read_pattern_table(uint8_t head_data[1084]) {
    for (uint8_t i = 0; i < 128; i++) {
       part_table[i] = 0;
    }
    for (uint8_t p = 0; p < 20; p++) {
        song_name[p] = head_data[p];
    }
    NUM_PATTERNS = head_data[950];
    for (uint8_t i = 0; i < NUM_PATTERNS; i++) {
        part_table[i] = head_data[952 + i];
        printf("%d ", part_table[i]);
    }
    printf("\n");
}

void read_samp_info(uint8_t head_data[1084]) {
    for (uint8_t i = 1; i < 33; i++) {
        uint8_t* sample_data = (uint8_t*)head_data + 20 + (i - 1) * 30;
        memcpy(samp_info[i].name, sample_data, 22);
        
        samp_info[i].len = (sample_data[22] << 8) | sample_data[23];  // 采样长度
        samp_info[i].finetune = sample_data[24];  // 微调值
        samp_info[i].vol = sample_data[25];  // 音量
        samp_info[i].loopStart = (sample_data[26] << 8) | sample_data[27];  // 重复点
        samp_info[i].loopLen = (sample_data[28] << 8) | sample_data[29];  // 重复长度
    }
}

