Rap1dPulzeTeam/ESP32Tracker/ESP32Tracker.cpp
void write_samp_info(uint8_t head_data[1084]) {
    for (uint8_t i = 1; i < 33; i++) {
        uint8_t* sample_data = (uint8_t*)head_data + 20 + (i - 1) * 30;
        memcpy(sample_data, samp_info[i].name, 22);  // 写入采样名
        
        sample_data[22] = (uint8_t)(samp_info[i].len >> 8);
        sample_data[23] = (uint8_t)(samp_info[i].len & 0xFF);  // 写入采样长度的低字节
        
        sample_data[24] = samp_info[i].finetune;  // 写入微调值
        sample_data[25] = samp_info[i].vol;  // 写入音量
        
        sample_data[26] = (uint8_t)(samp_info[i].loopStart >> 8);  // 写入重复点的高字节
        sample_data[27] = (uint8_t)(samp_info[i].loopStart & 0xFF);  // 写入重复点的低字节
        
        sample_data[28] = (uint8_t)(samp_info[i].loopLen >> 8);  // 写入重复长度的高字节
        sample_data[29] = (uint8_t)(samp_info[i].loopLen & 0xFF);  // 写入重复长度的低字节
    }
}

const char* root_path = "/spiffs";

void IRAM_ATTR rotate(ESPRotary& rotary) {
    uint8_t rtyRel = (uint8_t)rotary.getDirection();
    // printf("ROTARY %d\n", (int)rotary.getDirection());
    switch (RTY_MOD)
    {
    case RTY_VOL:
        if (rtyRel == 255) global_vol += 0.01;
        else global_vol -= 0.01;
        break;
    
    case RTY_MIX:
        if (rtyRel == 255) stroMix += 0.01;
        else stroMix -= 0.01;
        break;

    case RTY_CPU:
        // sendPopUpEvent("unsupported", 1024);
        break;
    }
}

void IRAM_ATTR setKeyOK() {
    RTY_MOD++;
    if (RTY_MOD > 3) RTY_MOD = 0;
    RtyB = true;
}

void refesMpr121(void *arg) {
    uint16_t lasttouched = 0;
    uint16_t currtouched = 0;
    Wire1.begin(15, 16);
    touchPad.begin(0x5B, &Wire1);
    key_event_t touchPadEvent;
    printf("MPR121 READY!\n");
    for (;;) {
        currtouched = touchPad.touched();
        for (uint8_t i=0; i<12; i++) {
            // it if *is* touched and *wasnt* touched before, alert!
            if ((currtouched & _BV(i)) && !(lasttouched & _BV(i)) ) {
                touchPadEvent.num = i;
                touchPadEvent.status = KEY_ATTACK;
                if (xQueueSend(xTouchPadQueue, &touchPadEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: TOUCHPAD QUEUE LOSS A EVENT!\n");
                }// else {
                //    printf("INFO: TOUCHPAD SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", touchPadEvent.num);
                //}
            }
            if (!(currtouched & _BV(i)) && (lasttouched & _BV(i)) ) {
                touchPadEvent.num = i;
                touchPadEvent.status = KEY_RELEASE;
                if (xQueueSend(xTouchPadQueue, &touchPadEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: TOUCHPAD QUEUE LOSS A EVENT!\n");
                }// else {
                //    printf("INFO: TOUCHPAD SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=RELEASE\n", touchPadEvent.num);
                //}
            }
        }
        lasttouched = currtouched;
        vTaskDelay(32);
    }
}

void input(void *arg) {
    pinMode(21, INPUT_PULLUP);
    rotary.begin(38, 39, 2);
    rotary.setChangedHandler(rotate);
    // rotary.setLeftRotationHandler(showDirection);
    // rotary.setRightRotationHandler(showDirection);
    Serial.begin(115200);
    attachInterrupt(21, setKeyOK, FALLING);
    key_event_t optionKeyEvent;
    bool fnA = false;
    bool fnB = false;
    bool fnC = false;
    temp_sensor_config_t temp_sensor = {
        .dac_offset = TSENS_DAC_L2,
        .clk_div = 6,
    };
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
    for (;;) {
        if (Serial.available() > 0) {
            uint16_t received = Serial.read();
            printf("INPUT: %d\n", received);
            if (received == 32) {
                optionKeyEvent.num = KEY_SPACE;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 119) {
                optionKeyEvent.num = KEY_UP;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 115) {
                optionKeyEvent.num = KEY_DOWN;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 97) {
                optionKeyEvent.num = KEY_L;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 100) {
                optionKeyEvent.num = KEY_R;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 108) {
                optionKeyEvent.num = KEY_OK;
                optionKeyEvent.status = KEY_ATTACK;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=ATTACK\n", optionKeyEvent.num);
                }
            }
            if (received == 122) {
                optionKeyEvent.num = KEY_A;
                optionKeyEvent.status = fnA ? KEY_RELEASE : KEY_ATTACK;
                fnA = !fnA;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=%s\n", optionKeyEvent.num, optionKeyEvent.status == KEY_ATTACK ? "ATTACK" : "RELEASE");
                }
            }
            if (received == 99) {
                optionKeyEvent.num = KEY_C;
                optionKeyEvent.status = fnC ? KEY_RELEASE : KEY_ATTACK;
                fnC = !fnC;
                if (xQueueSend(xOptionKeyQueue, &optionKeyEvent, portMAX_DELAY) != pdPASS) {
                    printf("WARNING: OPTIONKEY QUEUE LOSS A EVENT!\n");
                } else {
                    printf("INFO: OPTIONKEY SUCCESSFULLY SENT A EVENT. NUM=%d STATUS=%s\n", optionKeyEvent.num, optionKeyEvent.status == KEY_ATTACK ? "ATTACK" : "RELEASE");
                }
            }
            if (received == 49) {
                printf("INPUT SAMP NUM:\n");
                for (;;) {
                    if (Serial.available() > 0) {
                        uint16_t received = Serial.read();
                        smp_num[0] = received - 48;
                        printf("CHL0's SMP_NUM=%d NAME:%s\n", smp_num[0], samp_info[smp_num[0]].name);
                        break;
                    }
                    vTaskDelay(8);
                }
            }
            if (received == 50) {
                TestNote = true;
            }
            if (received == 102) {
                printf("Current CPU frequency: %u Hz\n", esp_clk_cpu_freq());
            }
            if (received == 116) {
                printf("CPU Core Temp: %.1f °C\n", temperatureRead());
            }
            if (received == 107) {
                vTaskPrioritySet(NULL, 5);
                FileInfo* files = NULL;
                int count = list_directory("/sdcard", &files);
                if (count < 0) {
                    printf("Failed to list directory.\n");
                }

                printf("Total files and directories: %d\n", count);
                for (int i = 0; i < count; i++) {
                    printf("%s - %s\n", files[i].name, files[i].is_directory ? "Directory" : "File");
                    free(files[i].name);
                }
                free(files);
                vTaskPrioritySet(NULL, 2);
            }
            if (received == 109) {
                printf("FREE MEM: %d\n", esp_get_free_heap_size());
            }
        }
        vTaskDelay(2);
        if (RtyB) {
            RtyB = false;
            switch (RTY_MOD)
            {
            case RTY_VOL:
                sendPopUpEvent("Volume Control", 1024);
                break;
            
            case RTY_MIX:
                sendPopUpEvent("Channel Mix Index", 1024);
                break;

            case RTY_CPU:
                sendPopUpEvent("Tracker Info", 1024);
                break;
            }
        }
    }
}

void setup()
{
    pinMode(LCD_BK, OUTPUT);
    analogWriteFrequency(22050);
    analogWrite(LCD_BK, 0);
    xTaskCreatePinnedToCore(&display, "wave_view", 8192, NULL, 5, NULL, 0); 
    tft.initR(INITR_BLACKTAB);
    tft.setSPISpeed(79000000);
    tft.setRotation(3);
    tft.fillScreen(ST7735_BLACK);
    frame.setFont(&abcd);
    initLimiter(&limiter, 16384*global_vol, 16380*global_vol);
    xTouchPadQueue = xQueueCreate(4, sizeof(key_event_t));
    xOptionKeyQueue = xQueueCreate(4, sizeof(key_event_t));
    popUpEventQueue = xQueueCreate(4, sizeof(popUpEvent_t));
    // initDelayBuffer();
    dispRedy = true;
    esp_err_t ret;
    esp_vfs_spiffs_conf_t spiffs_conf = {
        .base_path = "/spiffs",
        .partition_label = "spiffs",
        .max_files = 2,
        .format_if_mount_failed = true
    };
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 2,
        .allocation_unit_size = 8 * 1024
    };

    ret = esp_vfs_spiffs_register(&spiffs_conf);
    if (ret == ESP_OK) {
        printf("SPIFFS mounted!\n");
    } else {
        printf("SPIFFS ERROR! NOW FORMAT! PLEASE WAIT...\n");
    }

    if (!readConfig(&config)) {
        printf("Using default configuration\n");
        config = (Config_t){
            .enbLine = true,
            .enbCos = false,
            .enbCubic = false,
            .enbFltr = {false, false, false, false},
            .enbDelay = {false, false, false, false},
            .cutOffFreq = {0.0f, 0.0f, 0.0f, 0.0f}
        };
        writeConfig(&config);
    }

    sdmmc_card_t *card;
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 1;
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    slot_config.clk = GPIO_NUM_48;
    slot_config.cmd = GPIO_NUM_47;
    slot_config.d0 = GPIO_NUM_45;
    key_event_t optionKeyEvent;
    xTaskCreatePinnedToCore(&input, "input", 4096, NULL, 2, NULL, 0);
    ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    while (ret != ESP_OK) {
        dispSdcardError = true;
        analogWrite(LCD_BK, 255);
        MainReDraw();
        fillMidRect(151, 34, 0x4208);
        drawMidRect(151, 34, ST7735_WHITE);
        setMidCusr(151, 34, 4);
        frame.setTextColor(0x7bcf);
        uint8_t X=frame.getCursorX();
        frame.printf("SDCARD STATUS ERROR %x:\n", ret);
        frame.setCursor(X, frame.getCursorY()+2);
        frame.println((ret == 263) ? "SDCARD NOT FOUND" : ((ret == -1) ? "UNKNOW FILE SYSTEM" : "UNKNOW ERROR"));
        frame.setCursor(X, frame.getCursorY()+2);
        frame.printf("PRESS ANY KEY TO RETRY");
        setMidCusr(151, 34, 3);
        X=frame.getCursorX();
        frame.setTextColor(ST7735_WHITE);
        frame.printf("SDCARD STATUS ERROR %x:\n", ret);
        frame.setCursor(X, frame.getCursorY()+2);
        frame.println((ret == 263) ? "SDCARD NOT FOUND" : ((ret == -1) ? "UNKNOW FILE SYSTEM" : "UNKNOW ERROR"));
        frame.setCursor(X, frame.getCursorY()+2);
        frame.printf("PRESS ANY KEY TO RETRY");
        if (readOptionKeyEvent == pdTRUE) {
            MainReDraw();
            frame.display();
            ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
            vTaskDelay(4);
        }
        vTaskDelay(16);
        frame.display();
    }
    xTaskCreatePinnedToCore(&popUpTask, "Pop Up Task", 2048, NULL, 0, NULL, 0);
    xTaskCreatePinnedToCore(&display_lcd, "tracker_ui", 8192, NULL, 5, NULL, 1);
    xTaskCreatePinnedToCore(&refesMpr121, "MPR121", 4096, NULL, 0, NULL, 0);
    static const int i2s_num = 0; // i2s port number
    i2s_config_t i2s_config = {
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
        .sample_rate = SMP_RATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 8,
        .dma_buf_len = 256,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = 0
    };

    static const i2s_pin_config_t pin_config = {
        .bck_io_num = 42,
        .ws_io_num = 40,
        .data_out_num = 41,
        .data_in_num = I2S_PIN_NO_CHANGE
    };
    printf("I2S INSTALL %d\n", i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL));
    printf("I2S SETPIN %d\n", i2s_set_pin(I2S_NUM_0, &pin_config));
    i2s_set_clk(I2S_NUM_0, SMP_RATE, I2S_BITS_PER_CHAN_16BIT, I2S_CHANNEL_STEREO);
    i2s_zero_dma_buffer(I2S_NUM_0);
    new_tracker_file();
    vTaskDelay(256);
    printf("MAIN EXIT\n");
}

void loop() {
    printf("DELETE LOOP\n");
    vTaskDelete(NULL);
}